{
  "metadata": {
    "surah": 88,
    "analysis_type": "qalqala",
    "schema_version": "1.0",
    "status": "pending",
    "updated_at": "2026-02-07T08:02:56.657246+00:00",
    "created_at": "2026-02-04T16:50:50.404744+00:00"
  },
  "data": {
    "text": "هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ وُجُوهٌ يَوْمَئِذٍ خَاشِعَةٌ عَامِلَةٌ نَاصِبَةٌ تَصْلَىٰ نَارًا حَامِيَةً تُسْقَىٰ مِنْ عَيْنٍ آنِيَةٍ لَيْسَ لَهُمْ طَعَامٌ إِلَّا مِنْ ضَرِيعٍ لَا يُسْمِنُ وَلَا يُغْنِي مِنْ جُوعٍ وُجُوهٌ يَوْمَئِذٍ نَاعِمَةٌ لِسَعْيِهَا رَاضِيَةٌ فِي جَنَّةٍ عَالِيَةٍ لَا تَسْمَعُ فِيهَا لَاغِيَةً فِيهَا عَيْنٌ جَارِيَةٌ فِيهَا سُرُرٌ مَرْفُوعَةٌ وَأَكْوَابٌ مَوْضُوعَةٌ وَنَمَارِقُ مَصْفُوفَةٌ وَزَرَابِيُّ مَبْثُوثَةٌ أَفَلَا يَنْظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ وَإِلَى السَّمَاءِ كَيْفَ رُفِعَتْ وَإِلَى الْجِبَالِ كَيْفَ نُصِبَتْ وَإِلَى الْأَرْضِ كَيْفَ سُطِحَتْ فَذَكِّرْ إِنَّمَا أَنْتَ مُذَكِّرٌ لَسْتَ عَلَيْهِمْ بِمُصَيْطِرٍ إِلَّا مَنْ تَوَلَّىٰ وَكَفَرَ فَيُعَذِّبُهُ اللَّهُ الْعَذَابَ الْأَكْبَرَ إِنَّ إِلَيْنَا إِيَابَهُمْ ثُمَّ إِنَّ عَلَيْنَا حِسَابَهُمْ",
    "execution_mode": "optimized",
    "summary": {
      "total_qalqala": 1,
      "qalqala_sughra": 1,
      "qalqala_kubra": 0
    },
    "qalqala_letters": [
      "ق",
      "ط",
      "ب",
      "ج",
      "د"
    ],
    "explanations": [
      {
        "position": 434,
        "letter": "ب",
        "word": "مَبْثُوثَةٌ",
        "letter_position": "the 2nd letter (position 2 of 6)",
        "type": "Qalqala Sughra (Minor)",
        "rule": "qalqala_sughra",
        "is_sughra": true,
        "is_kubra": false,
        "explanation": "In the word 'مَبْثُوثَةٌ', at the 2nd letter (position 2 of 6), the letter 'ب' is sakin in the middle of the word. This is Qalqala Sughra (القلقلة الصغرى), meaning a light/minor echoing or vibrating sound. Pronounce the letter with a slight bounce or echo without fully releasing the pressure.",
        "urdu_explanation": "لفظ 'مَبْثُوثَةٌ' میں، the 2nd letter (position 2 of 6) پر، حرف 'ب' لفظ کے درمیان میں ساکن ہے۔ یہ قلقلہ صغریٰ ہے۔ اس حرف کو ہلکی اچھال کے ساتھ پڑھیں۔"
      }
    ],
    "positions": [
      [
        434,
        "ب"
      ]
    ]
  }
}