{
  "metadata": {
    "surah": 31,
    "analysis_type": "meem_ka_qaida",
    "schema_version": "1.0",
    "status": "pending",
    "updated_at": "2026-02-04T16:50:13.532411+00:00",
    "created_at": "2026-02-04T16:50:13.532390+00:00"
  },
  "data": {
    "text": "الم تِلْكَ آيَاتُ الْكِتَابِ الْحَكِيمِ هُدًى وَرَحْمَةً لِلْمُحْسِنِينَ الَّذِينَ يُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَهُمْ بِالْآخِرَةِ هُمْ يُوقِنُونَ أُولَـٰئِكَ عَلَىٰ هُدًى مِنْ رَبِّهِمْ ۖ وَأُولَـٰئِكَ هُمُ الْمُفْلِحُونَ وَمِنَ النَّاسِ مَنْ يَشْتَرِي لَهْوَ الْحَدِيثِ لِيُضِلَّ عَنْ سَبِيلِ اللَّهِ بِغَيْرِ عِلْمٍ وَيَتَّخِذَهَا هُزُوًا ۚ أُولَـٰئِكَ لَهُمْ عَذَابٌ مُهِينٌ وَإِذَا تُتْلَىٰ عَلَيْهِ آيَاتُنَا وَلَّىٰ مُسْتَكْبِرًا كَأَنْ لَمْ يَسْمَعْهَا كَأَنَّ فِي أُذُنَيْهِ وَقْرًا ۖ فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ جَنَّاتُ النَّعِيمِ خَالِدِينَ فِيهَا ۖ وَعْدَ اللَّهِ حَقًّا ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ خَلَقَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ۖ وَأَلْقَىٰ فِي الْأَرْضِ رَوَاسِيَ أَنْ تَمِيدَ بِكُمْ وَبَثَّ فِيهَا مِنْ كُلِّ دَابَّةٍ ۚ وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً فَأَنْبَتْنَا فِيهَا مِنْ كُلِّ زَوْجٍ كَرِيمٍ هَـٰذَا خَلْقُ اللَّهِ فَأَرُونِي مَاذَا خَلَقَ الَّذِينَ مِنْ دُونِهِ ۚ بَلِ الظَّالِمُونَ فِي ضَلَالٍ مُبِينٍ وَلَقَدْ آتَيْنَا لُقْمَانَ الْحِكْمَةَ أَنِ اشْكُرْ لِلَّهِ ۚ وَمَنْ يَشْكُرْ فَإِنَّمَا يَشْكُرُ لِنَفْسِهِ ۖ وَمَنْ كَفَرَ فَإِنَّ اللَّهَ غَنِيٌّ حَمِيدٌ وَإِذْ قَالَ لُقْمَانُ لِابْنِهِ وَهُوَ يَعِظُهُ يَا بُنَيَّ لَا تُشْرِكْ بِاللَّهِ ۖ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ وَوَصَّيْنَا الْإِنْسَانَ بِوَالِدَيْهِ حَمَلَتْهُ أُمُّهُ وَهْنًا عَلَىٰ وَهْنٍ وَفِصَالُهُ فِي عَامَيْنِ أَنِ اشْكُرْ لِي وَلِوَالِدَيْكَ إِلَيَّ الْمَصِيرُ وَإِنْ جَاهَدَاكَ عَلَىٰ أَنْ تُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا ۖ وَصَاحِبْهُمَا فِي الدُّنْيَا مَعْرُوفًا ۖ وَاتَّبِعْ سَبِيلَ مَنْ أَنَابَ إِلَيَّ ۚ ثُمَّ إِلَيَّ مَرْجِعُكُمْ فَأُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ يَا بُنَيَّ إِنَّهَا إِنْ تَكُ مِثْقَالَ حَبَّةٍ مِنْ خَرْدَلٍ فَتَكُنْ فِي صَخْرَةٍ أَوْ فِي السَّمَاوَاتِ أَوْ فِي الْأَرْضِ يَأْتِ بِهَا اللَّهُ ۚ إِنَّ اللَّهَ لَطِيفٌ خَبِيرٌ يَا بُنَيَّ أَقِمِ الصَّلَاةَ وَأْمُرْ بِالْمَعْرُوفِ وَانْهَ عَنِ الْمُنْكَرِ وَاصْبِرْ عَلَىٰ مَا أَصَابَكَ ۖ إِنَّ ذَٰلِكَ مِنْ عَزْمِ الْأُمُورِ وَلَا تُصَعِّرْ خَدَّكَ لِلنَّاسِ وَلَا تَمْشِ فِي الْأَرْضِ مَرَحًا ۖ إِنَّ اللَّهَ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ وَاقْصِدْ فِي مَشْيِكَ وَاغْضُضْ مِنْ صَوْتِكَ ۚ إِنَّ أَنْكَرَ الْأَصْوَاتِ لَصَوْتُ الْحَمِيرِ أَلَمْ تَرَوْا أَنَّ اللَّهَ سَخَّرَ لَكُمْ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَأَسْبَغَ عَلَيْكُمْ نِعَمَهُ ظَاهِرَةً وَبَاطِنَةً ۗ وَمِنَ النَّاسِ مَنْ يُجَادِلُ فِي اللَّهِ بِغَيْرِ عِلْمٍ وَلَا هُدًى وَلَا كِتَابٍ مُنِيرٍ وَإِذَا قِيلَ لَهُمُ اتَّبِعُوا مَا أَنْزَلَ اللَّهُ قَالُوا بَلْ نَتَّبِعُ مَا وَجَدْنَا عَلَيْهِ آبَاءَنَا ۚ أَوَلَوْ كَانَ الشَّيْطَانُ يَدْعُوهُمْ إِلَىٰ عَذَابِ السَّعِيرِ وَمَنْ يُسْلِمْ وَجْهَهُ إِلَى اللَّهِ وَهُوَ مُحْسِنٌ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ ۗ وَإِلَى اللَّهِ عَاقِبَةُ الْأُمُورِ وَمَنْ كَفَرَ فَلَا يَحْزُنْكَ كُفْرُهُ ۚ إِلَيْنَا مَرْجِعُهُمْ فَنُنَبِّئُهُمْ بِمَا عَمِلُوا ۚ إِنَّ اللَّهَ عَلِيمٌ بِذَاتِ الصُّدُورِ نُمَتِّعُهُمْ قَلِيلًا ثُمَّ نَضْطَرُّهُمْ إِلَىٰ عَذَابٍ غَلِيظٍ وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ ۚ قُلِ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ إِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ وَلَوْ أَنَّمَا فِي الْأَرْضِ مِنْ شَجَرَةٍ أَقْلَامٌ وَالْبَحْرُ يَمُدُّهُ مِنْ بَعْدِهِ سَبْعَةُ أَبْحُرٍ مَا نَفِدَتْ كَلِمَاتُ اللَّهِ ۗ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ مَا خَلْقُكُمْ وَلَا بَعْثُكُمْ إِلَّا كَنَفْسٍ وَاحِدَةٍ ۗ إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ أَلَمْ تَرَ أَنَّ اللَّهَ يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ كُلٌّ يَجْرِي إِلَىٰ أَجَلٍ مُسَمًّى وَأَنَّ اللَّهَ بِمَا تَعْمَلُونَ خَبِيرٌ ذَٰلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّ مَا يَدْعُونَ مِنْ دُونِهِ الْبَاطِلُ وَأَنَّ اللَّهَ هُوَ الْعَلِيُّ الْكَبِيرُ أَلَمْ تَرَ أَنَّ الْفُلْكَ تَجْرِي فِي الْبَحْرِ بِنِعْمَتِ اللَّهِ لِيُرِيَكُمْ مِنْ آيَاتِهِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِكُلِّ صَبَّارٍ شَكُورٍ وَإِذَا غَشِيَهُمْ مَوْجٌ كَالظُّلَلِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ فَمِنْهُمْ مُقْتَصِدٌ ۚ وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا كُلُّ خَتَّارٍ كَفُورٍ يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ وَاخْشَوْا يَوْمًا لَا يَجْزِي وَالِدٌ عَنْ وَلَدِهِ وَلَا مَوْلُودٌ هُوَ جَازٍ عَنْ وَالِدِهِ شَيْئًا ۚ إِنَّ وَعْدَ اللَّهِ حَقٌّ ۖ فَلَا تَغُرَّنَّكُمُ الْحَيَاةُ الدُّنْيَا وَلَا يَغُرَّنَّكُمْ بِاللَّهِ الْغَرُورُ إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الْأَرْحَامِ ۖ وَمَا تَدْرِي نَفْسٌ مَاذَا تَكْسِبُ غَدًا ۖ وَمَا تَدْرِي نَفْسٌ بِأَيِّ أَرْضٍ تَمُوتُ ۚ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ",
    "execution_mode": "optimized",
    "summary": {
      "total_meem_sakin": 40,
      "total_ikhfa_shafawi": 4,
      "total_idgham_shafawi": 9,
      "total_izhar_shafawi": 27
    },
    "explanations": [
      {
        "position": 132,
        "word": "وَهُمْ",
        "letter_position": "the last letter (position 3 of 3)",
        "next_word": "بِالْآخِرَةِ",
        "next_letter": "ب",
        "rule": "ikhfa_shafawi",
        "explanation": "In the word 'وَهُمْ', at the last letter (position 3 of 3), we find Meem Sakin (مْ). The next letter 'ب' (Ba) comes from the word 'بِالْآخِرَةِ'. When this happens, we apply Ikhfa Shafawi (إخفاء شفوي), which means you must conceal or hide the Meem Sakin with a light nasal sound (ghunnah) for two counts. The lips remain closed as you prepare to pronounce the Ba, and the sound is hidden between clear pronunciation and complete merging.",
        "urdu_explanation": "لفظ 'وَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ب' (با) لفظ 'بِالْآخِرَةِ' سے آتا ہے۔ یہاں اخفاء شفوی ہوگا۔ میم ساکن کو غنہ کے ساتھ چھپا کر بولیں گے۔ ہونٹ بند رکھیں اور با کی تیاری کریں۔ آواز واضح اور ملنے کے درمیان ہوگی۔"
      },
      {
        "position": 150,
        "word": "هُمْ",
        "letter_position": "the last letter (position 2 of 2)",
        "next_word": "يُوقِنُونَ",
        "next_letter": "ي",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'هُمْ', at the last letter (position 2 of 2), we find Meem Sakin (مْ). The next letter 'ي' comes from the word 'يُوقِنُونَ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'هُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ي' لفظ 'يُوقِنُونَ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 201,
        "word": "رَبِّهِمْ",
        "letter_position": "the last letter (position 4 of 4)",
        "next_word": "ۖ",
        "next_letter": "ۖ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'رَبِّهِمْ', at the last letter (position 4 of 4), we find Meem Sakin (مْ). The next letter 'ۖ' comes from the word 'ۖ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'رَبِّهِمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ۖ' لفظ 'ۖ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 377,
        "word": "لَهُمْ",
        "letter_position": "the 3rd letter (position 3 of 6)",
        "next_word": "عَذَابٌ",
        "next_letter": "ع",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَهُمْ', at the 3rd letter (position 3 of 6), we find Meem Sakin (مْ). The next letter 'ع' comes from the word 'عَذَابٌ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَهُمْ' میں، تیسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ع' لفظ 'عَذَابٌ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 463,
        "word": "لَمْ",
        "letter_position": "the last letter (position 2 of 2)",
        "next_word": "يَسْمَعْهَا",
        "next_letter": "ي",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَمْ', at the last letter (position 2 of 2), we find Meem Sakin (مْ). The next letter 'ي' comes from the word 'يَسْمَعْهَا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ي' لفظ 'يَسْمَعْهَا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 594,
        "word": "لَهُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "جَنَّاتُ",
        "next_letter": "ج",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَهُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'ج' comes from the word 'جَنَّاتُ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ج' لفظ 'جَنَّاتُ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 793,
        "word": "بِكُمْ",
        "letter_position": "the last letter (position 3 of 3)",
        "next_word": "وَبَثَّ",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'بِكُمْ', at the last letter (position 3 of 3), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَبَثَّ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'بِكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَبَثَّ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 1358,
        "word": "أُمُّهُ",
        "letter_position": "the 2nd letter (position 2 of 3)",
        "next_word": "أُمُّهُ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'أُمُّهُ', at the 2nd letter (position 2 of 3), we find Meem Sakin (مْ). The next letter 'م' (Meem) is within the same word. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'أُمُّهُ' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) اسی لفظ میں ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 1642,
        "word": "ثُمَّ",
        "letter_position": "the 2nd letter (position 2 of 4)",
        "next_word": "إِلَيَّ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'ثُمَّ', at the 2nd letter (position 2 of 4), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'إِلَيَّ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'ثُمَّ' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'إِلَيَّ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 1664,
        "word": "مَرْجِعُكُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "فَأُنَبِّئُكُمْ",
        "next_letter": "ف",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'مَرْجِعُكُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'ف' comes from the word 'فَأُنَبِّئُكُمْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'مَرْجِعُكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ف' لفظ 'فَأُنَبِّئُكُمْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 1680,
        "word": "فَأُنَبِّئُكُمْ",
        "letter_position": "the last letter (position 7 of 7)",
        "next_word": "بِمَا",
        "next_letter": "ب",
        "rule": "ikhfa_shafawi",
        "explanation": "In the word 'فَأُنَبِّئُكُمْ', at the last letter (position 7 of 7), we find Meem Sakin (مْ). The next letter 'ب' (Ba) comes from the word 'بِمَا'. When this happens, we apply Ikhfa Shafawi (إخفاء شفوي), which means you must conceal or hide the Meem Sakin with a light nasal sound (ghunnah) for two counts. The lips remain closed as you prepare to pronounce the Ba, and the sound is hidden between clear pronunciation and complete merging.",
        "urdu_explanation": "لفظ 'فَأُنَبِّئُكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ب' (با) لفظ 'بِمَا' سے آتا ہے۔ یہاں اخفاء شفوی ہوگا۔ میم ساکن کو غنہ کے ساتھ چھپا کر بولیں گے۔ ہونٹ بند رکھیں اور با کی تیاری کریں۔ آواز واضح اور ملنے کے درمیان ہوگی۔"
      },
      {
        "position": 1695,
        "word": "كُنْتُمْ",
        "letter_position": "the last letter (position 4 of 4)",
        "next_word": "تَعْمَلُونَ",
        "next_letter": "ت",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'كُنْتُمْ', at the last letter (position 4 of 4), we find Meem Sakin (مْ). The next letter 'ت' comes from the word 'تَعْمَلُونَ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'كُنْتُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ت' لفظ 'تَعْمَلُونَ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 2081,
        "word": "تَمْشِ",
        "letter_position": "the 2nd letter (position 2 of 3)",
        "next_word": "تَمْشِ",
        "next_letter": "ش",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'تَمْشِ', at the 2nd letter (position 2 of 3), we find Meem Sakin (مْ). The next letter 'ش' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'تَمْشِ' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ش' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 2261,
        "word": "أَلَمْ",
        "letter_position": "the 3rd letter (position 3 of 9)",
        "next_word": "تَرَوْا",
        "next_letter": "ت",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَلَمْ', at the 3rd letter (position 3 of 9), we find Meem Sakin (مْ). The next letter 'ت' comes from the word 'تَرَوْا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَلَمْ' میں، تیسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ت' لفظ 'تَرَوْا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 2298,
        "word": "لَكُمْ",
        "letter_position": "the last letter (position 3 of 3)",
        "next_word": "مَا",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'لَكُمْ', at the last letter (position 3 of 3), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مَا'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'لَكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مَا' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 2362,
        "word": "عَلَيْكُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "نِعَمَهُ",
        "next_letter": "ن",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'عَلَيْكُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ن' comes from the word 'نِعَمَهُ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'عَلَيْكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ن' لفظ 'نِعَمَهُ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 2639,
        "word": "يَدْعُوهُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "إِلَىٰ",
        "next_letter": "إ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'يَدْعُوهُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'إ' comes from the word 'إِلَىٰ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'يَدْعُوهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'إ' لفظ 'إِلَىٰ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 2681,
        "word": "يُسْلِمْ",
        "letter_position": "the last letter (position 4 of 4)",
        "next_word": "وَجْهَهُ",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'يُسْلِمْ', at the last letter (position 4 of 4), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَجْهَهُ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'يُسْلِمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَجْهَهُ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 2735,
        "word": "اسْتَمْسَكَ",
        "letter_position": "the 4th letter (position 4 of 6)",
        "next_word": "اسْتَمْسَكَ",
        "next_letter": "س",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'اسْتَمْسَكَ', at the 4th letter (position 4 of 6), we find Meem Sakin (مْ). The next letter 'س' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'اسْتَمْسَكَ' میں، چوتھا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'س' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 2869,
        "word": "مَرْجِعُهُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "فَنُنَبِّئُهُمْ",
        "next_letter": "ف",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'مَرْجِعُهُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'ف' comes from the word 'فَنُنَبِّئُهُمْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'مَرْجِعُهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ف' لفظ 'فَنُنَبِّئُهُمْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 2885,
        "word": "فَنُنَبِّئُهُمْ",
        "letter_position": "the last letter (position 7 of 7)",
        "next_word": "بِمَا",
        "next_letter": "ب",
        "rule": "ikhfa_shafawi",
        "explanation": "In the word 'فَنُنَبِّئُهُمْ', at the last letter (position 7 of 7), we find Meem Sakin (مْ). The next letter 'ب' (Ba) comes from the word 'بِمَا'. When this happens, we apply Ikhfa Shafawi (إخفاء شفوي), which means you must conceal or hide the Meem Sakin with a light nasal sound (ghunnah) for two counts. The lips remain closed as you prepare to pronounce the Ba, and the sound is hidden between clear pronunciation and complete merging.",
        "urdu_explanation": "لفظ 'فَنُنَبِّئُهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ب' (با) لفظ 'بِمَا' سے آتا ہے۔ یہاں اخفاء شفوی ہوگا۔ میم ساکن کو غنہ کے ساتھ چھپا کر بولیں گے۔ ہونٹ بند رکھیں اور با کی تیاری کریں۔ آواز واضح اور ملنے کے درمیان ہوگی۔"
      },
      {
        "position": 2957,
        "word": "نُمَتِّعُهُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "قَلِيلًا",
        "next_letter": "ق",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'نُمَتِّعُهُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'ق' comes from the word 'قَلِيلًا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'نُمَتِّعُهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ق' لفظ 'قَلِيلًا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 2971,
        "word": "ثُمَّ",
        "letter_position": "the last letter (position 4 of 4)",
        "next_word": "نَضْطَرُّهُمْ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'ثُمَّ', at the last letter (position 4 of 4), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'نَضْطَرُّهُمْ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'ثُمَّ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'نَضْطَرُّهُمْ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 2986,
        "word": "نَضْطَرُّهُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "إِلَىٰ",
        "next_letter": "إ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'نَضْطَرُّهُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'إ' comes from the word 'إِلَىٰ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'نَضْطَرُّهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'إ' لفظ 'إِلَىٰ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3031,
        "word": "سَأَلْتَهُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "مَنْ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'سَأَلْتَهُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مَنْ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'سَأَلْتَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مَنْ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 3105,
        "word": "الْحَمْدُ",
        "letter_position": "the 4th letter (position 4 of 5)",
        "next_word": "الْحَمْدُ",
        "next_letter": "د",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'الْحَمْدُ', at the 4th letter (position 4 of 5), we find Meem Sakin (مْ). The next letter 'د' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'الْحَمْدُ' میں، چوتھا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'د' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3135,
        "word": "أَكْثَرُهُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "لَا",
        "next_letter": "ل",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَكْثَرُهُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'ل' comes from the word 'لَا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَكْثَرُهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ل' لفظ 'لَا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3422,
        "word": "خَلْقُكُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "وَلَا",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'خَلْقُكُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَلَا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'خَلْقُكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَلَا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3439,
        "word": "بَعْثُكُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "إِلَّا",
        "next_letter": "إ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'بَعْثُكُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'إ' comes from the word 'إِلَّا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'بَعْثُكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'إ' لفظ 'إِلَّا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3504,
        "word": "أَلَمْ",
        "letter_position": "the 6th letter (position 6 of 9)",
        "next_word": "تَرَ",
        "next_letter": "ت",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَلَمْ', at the 6th letter (position 6 of 9), we find Meem Sakin (مْ). The next letter 'ت' comes from the word 'تَرَ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَلَمْ' میں، چھٹا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ت' لفظ 'تَرَ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3609,
        "word": "الشَّمْسَ",
        "letter_position": "the 4th letter (position 4 of 5)",
        "next_word": "الشَّمْسَ",
        "next_letter": "س",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'الشَّمْسَ', at the 4th letter (position 4 of 5), we find Meem Sakin (مْ). The next letter 'س' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'الشَّمْسَ' میں، چوتھا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'س' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3658,
        "word": "مُسَمًّى",
        "letter_position": "the 3rd letter (position 3 of 4)",
        "next_word": "مُسَمًّى",
        "next_letter": "ى",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'مُسَمًّى', at the 3rd letter (position 3 of 4), we find Meem Sakin (مْ). The next letter 'ى' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'مُسَمًّى' میں، تیسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ى' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3836,
        "word": "أَلَمْ",
        "letter_position": "the last letter (position 9 of 9)",
        "next_word": "تَرَ",
        "next_letter": "ت",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَلَمْ', at the last letter (position 9 of 9), we find Meem Sakin (مْ). The next letter 'ت' comes from the word 'تَرَ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَلَمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ت' لفظ 'تَرَ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3911,
        "word": "لِيُرِيَكُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "مِنْ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'لِيُرِيَكُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مِنْ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'لِيُرِيَكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مِنْ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 3998,
        "word": "غَشِيَهُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "مَوْجٌ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'غَشِيَهُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مَوْجٌ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'غَشِيَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مَوْجٌ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 4066,
        "word": "فَلَمَّا",
        "letter_position": "the 3rd letter (position 3 of 4)",
        "next_word": "فَلَمَّا",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'فَلَمَّا', at the 3rd letter (position 3 of 4), we find Meem Sakin (مْ). The next letter 'م' (Meem) is within the same word. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'فَلَمَّا' میں، تیسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) اسی لفظ میں ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 4079,
        "word": "نَجَّاهُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "إِلَى",
        "next_letter": "إ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'نَجَّاهُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'إ' comes from the word 'إِلَى'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'نَجَّاهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'إ' لفظ 'إِلَى' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 4105,
        "word": "فَمِنْهُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "مُقْتَصِدٌ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'فَمِنْهُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مُقْتَصِدٌ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'فَمِنْهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مُقْتَصِدٌ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 4216,
        "word": "رَبَّكُمْ",
        "letter_position": "the last letter (position 4 of 4)",
        "next_word": "وَاخْشَوْا",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'رَبَّكُمْ', at the last letter (position 4 of 4), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَاخْشَوْا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'رَبَّكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَاخْشَوْا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 4414,
        "word": "يَغُرَّنَّكُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "بِاللَّهِ",
        "next_letter": "ب",
        "rule": "ikhfa_shafawi",
        "explanation": "In the word 'يَغُرَّنَّكُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'ب' (Ba) comes from the word 'بِاللَّهِ'. When this happens, we apply Ikhfa Shafawi (إخفاء شفوي), which means you must conceal or hide the Meem Sakin with a light nasal sound (ghunnah) for two counts. The lips remain closed as you prepare to pronounce the Ba, and the sound is hidden between clear pronunciation and complete merging.",
        "urdu_explanation": "لفظ 'يَغُرَّنَّكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ب' (با) لفظ 'بِاللَّهِ' سے آتا ہے۔ یہاں اخفاء شفوی ہوگا۔ میم ساکن کو غنہ کے ساتھ چھپا کر بولیں گے۔ ہونٹ بند رکھیں اور با کی تیاری کریں۔ آواز واضح اور ملنے کے درمیان ہوگی۔"
      }
    ],
    "meem_sakin_positions": [
      132,
      150,
      201,
      377,
      463,
      594,
      793,
      1358,
      1642,
      1664,
      1680,
      1695,
      2081,
      2261,
      2298,
      2362,
      2639,
      2681,
      2735,
      2869,
      2885,
      2957,
      2971,
      2986,
      3031,
      3105,
      3135,
      3422,
      3439,
      3504,
      3609,
      3658,
      3836,
      3911,
      3998,
      4066,
      4079,
      4105,
      4216,
      4414
    ],
    "ikhfa_shafawi": [
      [
        132,
        "ب"
      ],
      [
        1680,
        "ب"
      ],
      [
        2885,
        "ب"
      ],
      [
        4414,
        "ب"
      ]
    ],
    "idgham_shafawi": [
      [
        1358,
        "م"
      ],
      [
        1642,
        "م"
      ],
      [
        2298,
        "م"
      ],
      [
        2971,
        "م"
      ],
      [
        3031,
        "م"
      ],
      [
        3911,
        "م"
      ],
      [
        3998,
        "م"
      ],
      [
        4066,
        "م"
      ],
      [
        4105,
        "م"
      ]
    ],
    "izhar_shafawi": [
      [
        150,
        "ي"
      ],
      [
        201,
        "ۖ"
      ],
      [
        377,
        "ع"
      ],
      [
        463,
        "ي"
      ],
      [
        594,
        "ج"
      ],
      [
        793,
        "و"
      ],
      [
        1664,
        "ف"
      ],
      [
        1695,
        "ت"
      ],
      [
        2081,
        "ش"
      ],
      [
        2261,
        "ت"
      ],
      [
        2362,
        "ن"
      ],
      [
        2639,
        "إ"
      ],
      [
        2681,
        "و"
      ],
      [
        2735,
        "س"
      ],
      [
        2869,
        "ف"
      ],
      [
        2957,
        "ق"
      ],
      [
        2986,
        "إ"
      ],
      [
        3105,
        "د"
      ],
      [
        3135,
        "ل"
      ],
      [
        3422,
        "و"
      ],
      [
        3439,
        "إ"
      ],
      [
        3504,
        "ت"
      ],
      [
        3609,
        "س"
      ],
      [
        3658,
        "ى"
      ],
      [
        3836,
        "ت"
      ],
      [
        4079,
        "إ"
      ],
      [
        4216,
        "و"
      ]
    ]
  }
}