{
  "metadata": {
    "surah": 88,
    "analysis_type": "meem_ka_qaida",
    "schema_version": "1.0",
    "status": "pending",
    "updated_at": "2026-02-04T16:50:50.399594+00:00",
    "created_at": "2026-02-04T16:50:50.399578+00:00"
  },
  "data": {
    "text": "هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ وُجُوهٌ يَوْمَئِذٍ خَاشِعَةٌ عَامِلَةٌ نَاصِبَةٌ تَصْلَىٰ نَارًا حَامِيَةً تُسْقَىٰ مِنْ عَيْنٍ آنِيَةٍ لَيْسَ لَهُمْ طَعَامٌ إِلَّا مِنْ ضَرِيعٍ لَا يُسْمِنُ وَلَا يُغْنِي مِنْ جُوعٍ وُجُوهٌ يَوْمَئِذٍ نَاعِمَةٌ لِسَعْيِهَا رَاضِيَةٌ فِي جَنَّةٍ عَالِيَةٍ لَا تَسْمَعُ فِيهَا لَاغِيَةً فِيهَا عَيْنٌ جَارِيَةٌ فِيهَا سُرُرٌ مَرْفُوعَةٌ وَأَكْوَابٌ مَوْضُوعَةٌ وَنَمَارِقُ مَصْفُوفَةٌ وَزَرَابِيُّ مَبْثُوثَةٌ أَفَلَا يَنْظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ وَإِلَى السَّمَاءِ كَيْفَ رُفِعَتْ وَإِلَى الْجِبَالِ كَيْفَ نُصِبَتْ وَإِلَى الْأَرْضِ كَيْفَ سُطِحَتْ فَذَكِّرْ إِنَّمَا أَنْتَ مُذَكِّرٌ لَسْتَ عَلَيْهِمْ بِمُصَيْطِرٍ إِلَّا مَنْ تَوَلَّىٰ وَكَفَرَ فَيُعَذِّبُهُ اللَّهُ الْعَذَابَ الْأَكْبَرَ إِنَّ إِلَيْنَا إِيَابَهُمْ ثُمَّ إِنَّ عَلَيْنَا حِسَابَهُمْ",
    "execution_mode": "optimized",
    "summary": {
      "total_meem_sakin": 5,
      "total_ikhfa_shafawi": 1,
      "total_idgham_shafawi": 1,
      "total_izhar_shafawi": 2
    },
    "explanations": [
      {
        "position": 149,
        "word": "لَهُمْ",
        "letter_position": "the last letter (position 3 of 3)",
        "next_word": "طَعَامٌ",
        "next_letter": "ط",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَهُمْ', at the last letter (position 3 of 3), we find Meem Sakin (مْ). The next letter 'ط' comes from the word 'طَعَامٌ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ط' لفظ 'طَعَامٌ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 651,
        "word": "عَلَيْهِمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "بِمُصَيْطِرٍ",
        "next_letter": "ب",
        "rule": "ikhfa_shafawi",
        "explanation": "In the word 'عَلَيْهِمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ب' (Ba) comes from the word 'بِمُصَيْطِرٍ'. When this happens, we apply Ikhfa Shafawi (إخفاء شفوي), which means you must conceal or hide the Meem Sakin with a light nasal sound (ghunnah) for two counts. The lips remain closed as you prepare to pronounce the Ba, and the sound is hidden between clear pronunciation and complete merging.",
        "urdu_explanation": "لفظ 'عَلَيْهِمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ب' (با) لفظ 'بِمُصَيْطِرٍ' سے آتا ہے۔ یہاں اخفاء شفوی ہوگا۔ میم ساکن کو غنہ کے ساتھ چھپا کر بولیں گے۔ ہونٹ بند رکھیں اور با کی تیاری کریں۔ آواز واضح اور ملنے کے درمیان ہوگی۔"
      },
      {
        "position": 768,
        "word": "إِيَابَهُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "ثُمَّ",
        "next_letter": "ث",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'إِيَابَهُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'ث' comes from the word 'ثُمَّ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'إِيَابَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ث' لفظ 'ثُمَّ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 773,
        "word": "ثُمَّ",
        "letter_position": "the last letter (position 2 of 2)",
        "next_word": "إِنَّ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'ثُمَّ', at the last letter (position 2 of 2), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'إِنَّ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'ثُمَّ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'إِنَّ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      }
    ],
    "meem_sakin_positions": [
      149,
      651,
      768,
      773,
      802
    ],
    "ikhfa_shafawi": [
      [
        651,
        "ب"
      ]
    ],
    "idgham_shafawi": [
      [
        773,
        "م"
      ]
    ],
    "izhar_shafawi": [
      [
        149,
        "ط"
      ],
      [
        768,
        "ث"
      ]
    ]
  }
}