{
  "metadata": {
    "surah": 87,
    "analysis_type": "meem_ka_qaida",
    "schema_version": "1.0",
    "status": "pending",
    "updated_at": "2026-02-07T08:02:56.418818+00:00",
    "created_at": "2026-02-04T16:50:50.153546+00:00"
  },
  "data": {
    "text": "سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى الَّذِي خَلَقَ فَسَوَّىٰ وَالَّذِي قَدَّرَ فَهَدَىٰ وَالَّذِي أَخْرَجَ الْمَرْعَىٰ فَجَعَلَهُ غُثَاءً أَحْوَىٰ سَنُقْرِئُكَ فَلَا تَنْسَىٰ إِلَّا مَا شَاءَ اللَّهُ ۚ إِنَّهُ يَعْلَمُ الْجَهْرَ وَمَا يَخْفَىٰ وَنُيَسِّرُكَ لِلْيُسْرَىٰ فَذَكِّرْ إِنْ نَفَعَتِ الذِّكْرَىٰ سَيَذَّكَّرُ مَنْ يَخْشَىٰ وَيَتَجَنَّبُهَا الْأَشْقَى الَّذِي يَصْلَى النَّارَ الْكُبْرَىٰ ثُمَّ لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ قَدْ أَفْلَحَ مَنْ تَزَكَّىٰ وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّىٰ بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا وَالْآخِرَةُ خَيْرٌ وَأَبْقَىٰ إِنَّ هَـٰذَا لَفِي الصُّحُفِ الْأُولَىٰ صُحُفِ إِبْرَاهِيمَ وَمُوسَىٰ",
    "execution_mode": "optimized",
    "summary": {
      "total_meem_sakin": 1,
      "total_ikhfa_shafawi": 0,
      "total_idgham_shafawi": 1,
      "total_izhar_shafawi": 0
    },
    "explanations": [
      {
        "position": 398,
        "word": "ثُمَّ",
        "letter_position": "the last letter (position 2 of 2)",
        "next_word": "ثُمَّ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'ثُمَّ', at the last letter (position 2 of 2), we find Meem Sakin (مْ). The next letter 'م' (Meem) is within the same word. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'ثُمَّ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) اسی لفظ میں ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      }
    ],
    "meem_sakin_positions": [
      398
    ],
    "ikhfa_shafawi": [],
    "idgham_shafawi": [
      [
        398,
        "م"
      ]
    ],
    "izhar_shafawi": []
  }
}