{
  "metadata": {
    "surah": 20,
    "analysis_type": "meem_ka_qaida",
    "schema_version": "1.0",
    "status": "pending",
    "updated_at": "2026-02-04T16:49:55.591109+00:00",
    "created_at": "2026-02-04T16:49:55.591080+00:00"
  },
  "data": {
    "text": "طه مَا أَنْزَلْنَا عَلَيْكَ الْقُرْآنَ لِتَشْقَىٰ إِلَّا تَذْكِرَةً لِمَنْ يَخْشَىٰ تَنْزِيلًا مِمَّنْ خَلَقَ الْأَرْضَ وَالسَّمَاوَاتِ الْعُلَى الرَّحْمَـٰنُ عَلَى الْعَرْشِ اسْتَوَىٰ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَمَا بَيْنَهُمَا وَمَا تَحْتَ الثَّرَىٰ وَإِنْ تَجْهَرْ بِالْقَوْلِ فَإِنَّهُ يَعْلَمُ السِّرَّ وَأَخْفَى اللَّهُ لَا إِلَـٰهَ إِلَّا هُوَ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ وَهَلْ أَتَاكَ حَدِيثُ مُوسَىٰ إِذْ رَأَىٰ نَارًا فَقَالَ لِأَهْلِهِ امْكُثُوا إِنِّي آنَسْتُ نَارًا لَعَلِّي آتِيكُمْ مِنْهَا بِقَبَسٍ أَوْ أَجِدُ عَلَى النَّارِ هُدًى فَلَمَّا أَتَاهَا نُودِيَ يَا مُوسَىٰ إِنِّي أَنَا رَبُّكَ فَاخْلَعْ نَعْلَيْكَ ۖ إِنَّكَ بِالْوَادِ الْمُقَدَّسِ طُوًى وَأَنَا اخْتَرْتُكَ فَاسْتَمِعْ لِمَا يُوحَىٰ إِنَّنِي أَنَا اللَّهُ لَا إِلَـٰهَ إِلَّا أَنَا فَاعْبُدْنِي وَأَقِمِ الصَّلَاةَ لِذِكْرِي إِنَّ السَّاعَةَ آتِيَةٌ أَكَادُ أُخْفِيهَا لِتُجْزَىٰ كُلُّ نَفْسٍ بِمَا تَسْعَىٰ فَلَا يَصُدَّنَّكَ عَنْهَا مَنْ لَا يُؤْمِنُ بِهَا وَاتَّبَعَ هَوَاهُ فَتَرْدَىٰ وَمَا تِلْكَ بِيَمِينِكَ يَا مُوسَىٰ قَالَ هِيَ عَصَايَ أَتَوَكَّأُ عَلَيْهَا وَأَهُشُّ بِهَا عَلَىٰ غَنَمِي وَلِيَ فِيهَا مَآرِبُ أُخْرَىٰ قَالَ أَلْقِهَا يَا مُوسَىٰ فَأَلْقَاهَا فَإِذَا هِيَ حَيَّةٌ تَسْعَىٰ قَالَ خُذْهَا وَلَا تَخَفْ ۖ سَنُعِيدُهَا سِيرَتَهَا الْأُولَىٰ وَاضْمُمْ يَدَكَ إِلَىٰ جَنَاحِكَ تَخْرُجْ بَيْضَاءَ مِنْ غَيْرِ سُوءٍ آيَةً أُخْرَىٰ لِنُرِيَكَ مِنْ آيَاتِنَا الْكُبْرَى اذْهَبْ إِلَىٰ فِرْعَوْنَ إِنَّهُ طَغَىٰ قَالَ رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي يَفْقَهُوا قَوْلِي وَاجْعَلْ لِي وَزِيرًا مِنْ أَهْلِي هَارُونَ أَخِي اشْدُدْ بِهِ أَزْرِي وَأَشْرِكْهُ فِي أَمْرِي كَيْ نُسَبِّحَكَ كَثِيرًا وَنَذْكُرَكَ كَثِيرًا إِنَّكَ كُنْتَ بِنَا بَصِيرًا قَالَ قَدْ أُوتِيتَ سُؤْلَكَ يَا مُوسَىٰ وَلَقَدْ مَنَنَّا عَلَيْكَ مَرَّةً أُخْرَىٰ إِذْ أَوْحَيْنَا إِلَىٰ أُمِّكَ مَا يُوحَىٰ أَنِ اقْذِفِيهِ فِي التَّابُوتِ فَاقْذِفِيهِ فِي الْيَمِّ فَلْيُلْقِهِ الْيَمُّ بِالسَّاحِلِ يَأْخُذْهُ عَدُوٌّ لِي وَعَدُوٌّ لَهُ ۚ وَأَلْقَيْتُ عَلَيْكَ مَحَبَّةً مِنِّي وَلِتُصْنَعَ عَلَىٰ عَيْنِي إِذْ تَمْشِي أُخْتُكَ فَتَقُولُ هَلْ أَدُلُّكُمْ عَلَىٰ مَنْ يَكْفُلُهُ ۖ فَرَجَعْنَاكَ إِلَىٰ أُمِّكَ كَيْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ ۚ وَقَتَلْتَ نَفْسًا فَنَجَّيْنَاكَ مِنَ الْغَمِّ وَفَتَنَّاكَ فُتُونًا ۚ فَلَبِثْتَ سِنِينَ فِي أَهْلِ مَدْيَنَ ثُمَّ جِئْتَ عَلَىٰ قَدَرٍ يَا مُوسَىٰ وَاصْطَنَعْتُكَ لِنَفْسِي اذْهَبْ أَنْتَ وَأَخُوكَ بِآيَاتِي وَلَا تَنِيَا فِي ذِكْرِي اذْهَبَا إِلَىٰ فِرْعَوْنَ إِنَّهُ طَغَىٰ فَقُولَا لَهُ قَوْلًا لَيِّنًا لَعَلَّهُ يَتَذَكَّرُ أَوْ يَخْشَىٰ قَالَا رَبَّنَا إِنَّنَا نَخَافُ أَنْ يَفْرُطَ عَلَيْنَا أَوْ أَنْ يَطْغَىٰ قَالَ لَا تَخَافَا ۖ إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَىٰ فَأْتِيَاهُ فَقُولَا إِنَّا رَسُولَا رَبِّكَ فَأَرْسِلْ مَعَنَا بَنِي إِسْرَائِيلَ وَلَا تُعَذِّبْهُمْ ۖ قَدْ جِئْنَاكَ بِآيَةٍ مِنْ رَبِّكَ ۖ وَالسَّلَامُ عَلَىٰ مَنِ اتَّبَعَ الْهُدَىٰ إِنَّا قَدْ أُوحِيَ إِلَيْنَا أَنَّ الْعَذَابَ عَلَىٰ مَنْ كَذَّبَ وَتَوَلَّىٰ قَالَ فَمَنْ رَبُّكُمَا يَا مُوسَىٰ قَالَ رَبُّنَا الَّذِي أَعْطَىٰ كُلَّ شَيْءٍ خَلْقَهُ ثُمَّ هَدَىٰ قَالَ فَمَا بَالُ الْقُرُونِ الْأُولَىٰ قَالَ عِلْمُهَا عِنْدَ رَبِّي فِي كِتَابٍ ۖ لَا يَضِلُّ رَبِّي وَلَا يَنْسَى الَّذِي جَعَلَ لَكُمُ الْأَرْضَ مَهْدًا وَسَلَكَ لَكُمْ فِيهَا سُبُلًا وَأَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجْنَا بِهِ أَزْوَاجًا مِنْ نَبَاتٍ شَتَّىٰ كُلُوا وَارْعَوْا أَنْعَامَكُمْ ۗ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِأُولِي النُّهَىٰ مِنْهَا خَلَقْنَاكُمْ وَفِيهَا نُعِيدُكُمْ وَمِنْهَا نُخْرِجُكُمْ تَارَةً أُخْرَىٰ وَلَقَدْ أَرَيْنَاهُ آيَاتِنَا كُلَّهَا فَكَذَّبَ وَأَبَىٰ قَالَ أَجِئْتَنَا لِتُخْرِجَنَا مِنْ أَرْضِنَا بِسِحْرِكَ يَا مُوسَىٰ فَلَنَأْتِيَنَّكَ بِسِحْرٍ مِثْلِهِ فَاجْعَلْ بَيْنَنَا وَبَيْنَكَ مَوْعِدًا لَا نُخْلِفُهُ نَحْنُ وَلَا أَنْتَ مَكَانًا سُوًى قَالَ مَوْعِدُكُمْ يَوْمُ الزِّينَةِ وَأَنْ يُحْشَرَ النَّاسُ ضُحًى فَتَوَلَّىٰ فِرْعَوْنُ فَجَمَعَ كَيْدَهُ ثُمَّ أَتَىٰ قَالَ لَهُمْ مُوسَىٰ وَيْلَكُمْ لَا تَفْتَرُوا عَلَى اللَّهِ كَذِبًا فَيُسْحِتَكُمْ بِعَذَابٍ ۖ وَقَدْ خَابَ مَنِ افْتَرَىٰ فَتَنَازَعُوا أَمْرَهُمْ بَيْنَهُمْ وَأَسَرُّوا النَّجْوَىٰ قَالُوا إِنْ هَـٰذَانِ لَسَاحِرَانِ يُرِيدَانِ أَنْ يُخْرِجَاكُمْ مِنْ أَرْضِكُمْ بِسِحْرِهِمَا وَيَذْهَبَا بِطَرِيقَتِكُمُ الْمُثْلَىٰ فَأَجْمِعُوا كَيْدَكُمْ ثُمَّ ائْتُوا صَفًّا ۚ وَقَدْ أَفْلَحَ الْيَوْمَ مَنِ اسْتَعْلَىٰ قَالُوا يَا مُوسَىٰ إِمَّا أَنْ تُلْقِيَ وَإِمَّا أَنْ نَكُونَ أَوَّلَ مَنْ أَلْقَىٰ قَالَ بَلْ أَلْقُوا ۖ فَإِذَا حِبَالُهُمْ وَعِصِيُّهُمْ يُخَيَّلُ إِلَيْهِ مِنْ سِحْرِهِمْ أَنَّهَا تَسْعَىٰ فَأَوْجَسَ فِي نَفْسِهِ خِيفَةً مُوسَىٰ قُلْنَا لَا تَخَفْ إِنَّكَ أَنْتَ الْأَعْلَىٰ وَأَلْقِ مَا فِي يَمِينِكَ تَلْقَفْ مَا صَنَعُوا ۖ إِنَّمَا صَنَعُوا كَيْدُ سَاحِرٍ ۖ وَلَا يُفْلِحُ السَّاحِرُ حَيْثُ أَتَىٰ فَأُلْقِيَ السَّحَرَةُ سُجَّدًا قَالُوا آمَنَّا بِرَبِّ هَارُونَ وَمُوسَىٰ قَالَ آمَنْتُمْ لَهُ قَبْلَ أَنْ آذَنَ لَكُمْ ۖ إِنَّهُ لَكَبِيرُكُمُ الَّذِي عَلَّمَكُمُ السِّحْرَ ۖ فَلَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُمْ مِنْ خِلَافٍ وَلَأُصَلِّبَنَّكُمْ فِي جُذُوعِ النَّخْلِ وَلَتَعْلَمُنَّ أَيُّنَا أَشَدُّ عَذَابًا وَأَبْقَىٰ قَالُوا لَنْ نُؤْثِرَكَ عَلَىٰ مَا جَاءَنَا مِنَ الْبَيِّنَاتِ وَالَّذِي فَطَرَنَا ۖ فَاقْضِ مَا أَنْتَ قَاضٍ ۖ إِنَّمَا تَقْضِي هَـٰذِهِ الْحَيَاةَ الدُّنْيَا إِنَّا آمَنَّا بِرَبِّنَا لِيَغْفِرَ لَنَا خَطَايَانَا وَمَا أَكْرَهْتَنَا عَلَيْهِ مِنَ السِّحْرِ ۗ وَاللَّهُ خَيْرٌ وَأَبْقَىٰ إِنَّهُ مَنْ يَأْتِ رَبَّهُ مُجْرِمًا فَإِنَّ لَهُ جَهَنَّمَ لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ وَمَنْ يَأْتِهِ مُؤْمِنًا قَدْ عَمِلَ الصَّالِحَاتِ فَأُولَـٰئِكَ لَهُمُ الدَّرَجَاتُ الْعُلَىٰ جَنَّاتُ عَدْنٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ وَذَٰلِكَ جَزَاءُ مَنْ تَزَكَّىٰ وَلَقَدْ أَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنْ أَسْرِ بِعِبَادِي فَاضْرِبْ لَهُمْ طَرِيقًا فِي الْبَحْرِ يَبَسًا لَا تَخَافُ دَرَكًا وَلَا تَخْشَىٰ فَأَتْبَعَهُمْ فِرْعَوْنُ بِجُنُودِهِ فَغَشِيَهُمْ مِنَ الْيَمِّ مَا غَشِيَهُمْ وَأَضَلَّ فِرْعَوْنُ قَوْمَهُ وَمَا هَدَىٰ يَا بَنِي إِسْرَائِيلَ قَدْ أَنْجَيْنَاكُمْ مِنْ عَدُوِّكُمْ وَوَاعَدْنَاكُمْ جَانِبَ الطُّورِ الْأَيْمَنَ وَنَزَّلْنَا عَلَيْكُمُ الْمَنَّ وَالسَّلْوَىٰ كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَلَا تَطْغَوْا فِيهِ فَيَحِلَّ عَلَيْكُمْ غَضَبِي ۖ وَمَنْ يَحْلِلْ عَلَيْهِ غَضَبِي فَقَدْ هَوَىٰ وَإِنِّي لَغَفَّارٌ لِمَنْ تَابَ وَآمَنَ وَعَمِلَ صَالِحًا ثُمَّ اهْتَدَىٰ وَمَا أَعْجَلَكَ عَنْ قَوْمِكَ يَا مُوسَىٰ قَالَ هُمْ أُولَاءِ عَلَىٰ أَثَرِي وَعَجِلْتُ إِلَيْكَ رَبِّ لِتَرْضَىٰ قَالَ فَإِنَّا قَدْ فَتَنَّا قَوْمَكَ مِنْ بَعْدِكَ وَأَضَلَّهُمُ السَّامِرِيُّ فَرَجَعَ مُوسَىٰ إِلَىٰ قَوْمِهِ غَضْبَانَ أَسِفًا ۚ قَالَ يَا قَوْمِ أَلَمْ يَعِدْكُمْ رَبُّكُمْ وَعْدًا حَسَنًا ۚ أَفَطَالَ عَلَيْكُمُ الْعَهْدُ أَمْ أَرَدْتُمْ أَنْ يَحِلَّ عَلَيْكُمْ غَضَبٌ مِنْ رَبِّكُمْ فَأَخْلَفْتُمْ مَوْعِدِي قَالُوا مَا أَخْلَفْنَا مَوْعِدَكَ بِمَلْكِنَا وَلَـٰكِنَّا حُمِّلْنَا أَوْزَارًا مِنْ زِينَةِ الْقَوْمِ فَقَذَفْنَاهَا فَكَذَٰلِكَ أَلْقَى السَّامِرِيُّ فَأَخْرَجَ لَهُمْ عِجْلًا جَسَدًا لَهُ خُوَارٌ فَقَالُوا هَـٰذَا إِلَـٰهُكُمْ وَإِلَـٰهُ مُوسَىٰ فَنَسِيَ أَفَلَا يَرَوْنَ أَلَّا يَرْجِعُ إِلَيْهِمْ قَوْلًا وَلَا يَمْلِكُ لَهُمْ ضَرًّا وَلَا نَفْعًا وَلَقَدْ قَالَ لَهُمْ هَارُونُ مِنْ قَبْلُ يَا قَوْمِ إِنَّمَا فُتِنْتُمْ بِهِ ۖ وَإِنَّ رَبَّكُمُ الرَّحْمَـٰنُ فَاتَّبِعُونِي وَأَطِيعُوا أَمْرِي قَالُوا لَنْ نَبْرَحَ عَلَيْهِ عَاكِفِينَ حَتَّىٰ يَرْجِعَ إِلَيْنَا مُوسَىٰ قَالَ يَا هَارُونُ مَا مَنَعَكَ إِذْ رَأَيْتَهُمْ ضَلُّوا أَلَّا تَتَّبِعَنِ ۖ أَفَعَصَيْتَ أَمْرِي قَالَ يَا ابْنَ أُمَّ لَا تَأْخُذْ بِلِحْيَتِي وَلَا بِرَأْسِي ۖ إِنِّي خَشِيتُ أَنْ تَقُولَ فَرَّقْتَ بَيْنَ بَنِي إِسْرَائِيلَ وَلَمْ تَرْقُبْ قَوْلِي قَالَ فَمَا خَطْبُكَ يَا سَامِرِيُّ قَالَ بَصُرْتُ بِمَا لَمْ يَبْصُرُوا بِهِ فَقَبَضْتُ قَبْضَةً مِنْ أَثَرِ الرَّسُولِ فَنَبَذْتُهَا وَكَذَٰلِكَ سَوَّلَتْ لِي نَفْسِي قَالَ فَاذْهَبْ فَإِنَّ لَكَ فِي الْحَيَاةِ أَنْ تَقُولَ لَا مِسَاسَ ۖ وَإِنَّ لَكَ مَوْعِدًا لَنْ تُخْلَفَهُ ۖ وَانْظُرْ إِلَىٰ إِلَـٰهِكَ الَّذِي ظَلْتَ عَلَيْهِ عَاكِفًا ۖ لَنُحَرِّقَنَّهُ ثُمَّ لَنَنْسِفَنَّهُ فِي الْيَمِّ نَسْفًا إِنَّمَا إِلَـٰهُكُمُ اللَّهُ الَّذِي لَا إِلَـٰهَ إِلَّا هُوَ ۚ وَسِعَ كُلَّ شَيْءٍ عِلْمًا كَذَٰلِكَ نَقُصُّ عَلَيْكَ مِنْ أَنْبَاءِ مَا قَدْ سَبَقَ ۚ وَقَدْ آتَيْنَاكَ مِنْ لَدُنَّا ذِكْرًا مَنْ أَعْرَضَ عَنْهُ فَإِنَّهُ يَحْمِلُ يَوْمَ الْقِيَامَةِ وِزْرًا خَالِدِينَ فِيهِ ۖ وَسَاءَ لَهُمْ يَوْمَ الْقِيَامَةِ حِمْلًا يَوْمَ يُنْفَخُ فِي الصُّورِ ۚ وَنَحْشُرُ الْمُجْرِمِينَ يَوْمَئِذٍ زُرْقًا يَتَخَافَتُونَ بَيْنَهُمْ إِنْ لَبِثْتُمْ إِلَّا عَشْرًا نَحْنُ أَعْلَمُ بِمَا يَقُولُونَ إِذْ يَقُولُ أَمْثَلُهُمْ طَرِيقَةً إِنْ لَبِثْتُمْ إِلَّا يَوْمًا وَيَسْأَلُونَكَ عَنِ الْجِبَالِ فَقُلْ يَنْسِفُهَا رَبِّي نَسْفًا فَيَذَرُهَا قَاعًا صَفْصَفًا لَا تَرَىٰ فِيهَا عِوَجًا وَلَا أَمْتًا يَوْمَئِذٍ يَتَّبِعُونَ الدَّاعِيَ لَا عِوَجَ لَهُ ۖ وَخَشَعَتِ الْأَصْوَاتُ لِلرَّحْمَـٰنِ فَلَا تَسْمَعُ إِلَّا هَمْسًا يَوْمَئِذٍ لَا تَنْفَعُ الشَّفَاعَةُ إِلَّا مَنْ أَذِنَ لَهُ الرَّحْمَـٰنُ وَرَضِيَ لَهُ قَوْلًا يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِهِ عِلْمًا وَعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ ۖ وَقَدْ خَابَ مَنْ حَمَلَ ظُلْمًا وَمَنْ يَعْمَلْ مِنَ الصَّالِحَاتِ وَهُوَ مُؤْمِنٌ فَلَا يَخَافُ ظُلْمًا وَلَا هَضْمًا وَكَذَٰلِكَ أَنْزَلْنَاهُ قُرْآنًا عَرَبِيًّا وَصَرَّفْنَا فِيهِ مِنَ الْوَعِيدِ لَعَلَّهُمْ يَتَّقُونَ أَوْ يُحْدِثُ لَهُمْ ذِكْرًا فَتَعَالَى اللَّهُ الْمَلِكُ الْحَقُّ ۗ وَلَا تَعْجَلْ بِالْقُرْآنِ مِنْ قَبْلِ أَنْ يُقْضَىٰ إِلَيْكَ وَحْيُهُ ۖ وَقُلْ رَبِّ زِدْنِي عِلْمًا وَلَقَدْ عَهِدْنَا إِلَىٰ آدَمَ مِنْ قَبْلُ فَنَسِيَ وَلَمْ نَجِدْ لَهُ عَزْمًا وَإِذْ قُلْنَا لِلْمَلَائِكَةِ اسْجُدُوا لِآدَمَ فَسَجَدُوا إِلَّا إِبْلِيسَ أَبَىٰ فَقُلْنَا يَا آدَمُ إِنَّ هَـٰذَا عَدُوٌّ لَكَ وَلِزَوْجِكَ فَلَا يُخْرِجَنَّكُمَا مِنَ الْجَنَّةِ فَتَشْقَىٰ إِنَّ لَكَ أَلَّا تَجُوعَ فِيهَا وَلَا تَعْرَىٰ وَأَنَّكَ لَا تَظْمَأُ فِيهَا وَلَا تَضْحَىٰ فَوَسْوَسَ إِلَيْهِ الشَّيْطَانُ قَالَ يَا آدَمُ هَلْ أَدُلُّكَ عَلَىٰ شَجَرَةِ الْخُلْدِ وَمُلْكٍ لَا يَبْلَىٰ فَأَكَلَا مِنْهَا فَبَدَتْ لَهُمَا سَوْآتُهُمَا وَطَفِقَا يَخْصِفَانِ عَلَيْهِمَا مِنْ وَرَقِ الْجَنَّةِ ۚ وَعَصَىٰ آدَمُ رَبَّهُ فَغَوَىٰ ثُمَّ اجْتَبَاهُ رَبُّهُ فَتَابَ عَلَيْهِ وَهَدَىٰ قَالَ اهْبِطَا مِنْهَا جَمِيعًا ۖ بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ ۖ فَإِمَّا يَأْتِيَنَّكُمْ مِنِّي هُدًى فَمَنِ اتَّبَعَ هُدَايَ فَلَا يَضِلُّ وَلَا يَشْقَىٰ وَمَنْ أَعْرَضَ عَنْ ذِكْرِي فَإِنَّ لَهُ مَعِيشَةً ضَنْكًا وَنَحْشُرُهُ يَوْمَ الْقِيَامَةِ أَعْمَىٰ قَالَ رَبِّ لِمَ حَشَرْتَنِي أَعْمَىٰ وَقَدْ كُنْتُ بَصِيرًا قَالَ كَذَٰلِكَ أَتَتْكَ آيَاتُنَا فَنَسِيتَهَا ۖ وَكَذَٰلِكَ الْيَوْمَ تُنْسَىٰ وَكَذَٰلِكَ نَجْزِي مَنْ أَسْرَفَ وَلَمْ يُؤْمِنْ بِآيَاتِ رَبِّهِ ۚ وَلَعَذَابُ الْآخِرَةِ أَشَدُّ وَأَبْقَىٰ أَفَلَمْ يَهْدِ لَهُمْ كَمْ أَهْلَكْنَا قَبْلَهُمْ مِنَ الْقُرُونِ يَمْشُونَ فِي مَسَاكِنِهِمْ ۗ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِأُولِي النُّهَىٰ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَبِّكَ لَكَانَ لِزَامًا وَأَجَلٌ مُسَمًّى فَاصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا ۖ وَمِنْ آنَاءِ اللَّيْلِ فَسَبِّحْ وَأَطْرَافَ النَّهَارِ لَعَلَّكَ تَرْضَىٰ وَلَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِ أَزْوَاجًا مِنْهُمْ زَهْرَةَ الْحَيَاةِ الدُّنْيَا لِنَفْتِنَهُمْ فِيهِ ۚ وَرِزْقُ رَبِّكَ خَيْرٌ وَأَبْقَىٰ وَأْمُرْ أَهْلَكَ بِالصَّلَاةِ وَاصْطَبِرْ عَلَيْهَا ۖ لَا نَسْأَلُكَ رِزْقًا ۖ نَحْنُ نَرْزُقُكَ ۗ وَالْعَاقِبَةُ لِلتَّقْوَىٰ وَقَالُوا لَوْلَا يَأْتِينَا بِآيَةٍ مِنْ رَبِّهِ ۚ أَوَلَمْ تَأْتِهِمْ بَيِّنَةُ مَا فِي الصُّحُفِ الْأُولَىٰ وَلَوْ أَنَّا أَهْلَكْنَاهُمْ بِعَذَابٍ مِنْ قَبْلِهِ لَقَالُوا رَبَّنَا لَوْلَا أَرْسَلْتَ إِلَيْنَا رَسُولًا فَنَتَّبِعَ آيَاتِكَ مِنْ قَبْلِ أَنْ نَذِلَّ وَنَخْزَىٰ قُلْ كُلٌّ مُتَرَبِّصٌ فَتَرَبَّصُوا ۖ فَسَتَعْلَمُونَ مَنْ أَصْحَابُ الصِّرَاطِ السَّوِيِّ وَمَنِ اهْتَدَىٰ",
    "execution_mode": "optimized",
    "summary": {
      "total_meem_sakin": 113,
      "total_ikhfa_shafawi": 6,
      "total_idgham_shafawi": 30,
      "total_izhar_shafawi": 77
    },
    "explanations": [
      {
        "position": 97,
        "word": "مِمَّنْ",
        "letter_position": "the 2nd letter (position 2 of 3)",
        "next_word": "مِمَّنْ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'مِمَّنْ', at the 2nd letter (position 2 of 3), we find Meem Sakin (مْ). The next letter 'م' (Meem) is within the same word. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'مِمَّنْ' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) اسی لفظ میں ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 474,
        "word": "امْكُثُوا",
        "letter_position": "the 2nd letter (position 2 of 6)",
        "next_word": "امْكُثُوا",
        "next_letter": "ك",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'امْكُثُوا', at the 2nd letter (position 2 of 6), we find Meem Sakin (مْ). The next letter 'ك' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'امْكُثُوا' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ك' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 520,
        "word": "آتِيكُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "مِنْهَا",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'آتِيكُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مِنْهَا'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'آتِيكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مِنْهَا' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 577,
        "word": "فَلَمَّا",
        "letter_position": "the 3rd letter (position 3 of 4)",
        "next_word": "فَلَمَّا",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'فَلَمَّا', at the 3rd letter (position 3 of 4), we find Meem Sakin (مْ). The next letter 'م' (Meem) is within the same word. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'فَلَمَّا' میں، تیسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) اسی لفظ میں ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 1277,
        "word": "وَاضْمُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "يَدَكَ",
        "next_letter": "ي",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'وَاضْمُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ي' comes from the word 'يَدَكَ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'وَاضْمُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ي' لفظ 'يَدَكَ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 1482,
        "word": "أَمْرِي",
        "letter_position": "the 2nd letter (position 2 of 16)",
        "next_word": "أَمْرِي",
        "next_letter": "ر",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَمْرِي', at the 2nd letter (position 2 of 16), we find Meem Sakin (مْ). The next letter 'ر' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَمْرِي' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ر' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 1631,
        "word": "أَمْرِي",
        "letter_position": "the 6th letter (position 6 of 16)",
        "next_word": "أَمْرِي",
        "next_letter": "ر",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَمْرِي', at the 6th letter (position 6 of 16), we find Meem Sakin (مْ). The next letter 'ر' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَمْرِي' میں، چھٹا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ر' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 1826,
        "word": "أُمِّكَ",
        "letter_position": "the 2nd letter (position 2 of 6)",
        "next_word": "أُمِّكَ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'أُمِّكَ', at the 2nd letter (position 2 of 6), we find Meem Sakin (مْ). The next letter 'م' (Meem) is within the same word. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'أُمِّكَ' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) اسی لفظ میں ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 1898,
        "word": "الْيَمِّ",
        "letter_position": "the 4th letter (position 4 of 12)",
        "next_word": "فَلْيُلْقِهِ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'الْيَمِّ', at the 4th letter (position 4 of 12), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'فَلْيُلْقِهِ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'الْيَمِّ' میں، چوتھا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'فَلْيُلْقِهِ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 1920,
        "word": "الْيَمُّ",
        "letter_position": "the last letter (position 4 of 4)",
        "next_word": "بِالسَّاحِلِ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'الْيَمُّ', at the last letter (position 4 of 4), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'بِالسَّاحِلِ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'الْيَمُّ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'بِالسَّاحِلِ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 2051,
        "word": "تَمْشِي",
        "letter_position": "the 2nd letter (position 2 of 4)",
        "next_word": "تَمْشِي",
        "next_letter": "ش",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'تَمْشِي', at the 2nd letter (position 2 of 4), we find Meem Sakin (مْ). The next letter 'ش' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'تَمْشِي' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ش' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 2090,
        "word": "أَدُلُّكُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "عَلَىٰ",
        "next_letter": "ع",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَدُلُّكُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ع' comes from the word 'عَلَىٰ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَدُلُّكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ع' لفظ 'عَلَىٰ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 2141,
        "word": "أُمِّكَ",
        "letter_position": "the 5th letter (position 5 of 6)",
        "next_word": "أُمِّكَ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'أُمِّكَ', at the 5th letter (position 5 of 6), we find Meem Sakin (مْ). The next letter 'م' (Meem) is within the same word. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'أُمِّكَ' میں، پانچواں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) اسی لفظ میں ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 2231,
        "word": "الْغَمِّ",
        "letter_position": "the last letter (position 4 of 4)",
        "next_word": "وَفَتَنَّاكَ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'الْغَمِّ', at the last letter (position 4 of 4), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'وَفَتَنَّاكَ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'الْغَمِّ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'وَفَتَنَّاكَ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 2300,
        "word": "ثُمَّ",
        "letter_position": "the 2nd letter (position 2 of 14)",
        "next_word": "جِئْتَ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'ثُمَّ', at the 2nd letter (position 2 of 14), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'جِئْتَ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'ثُمَّ' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'جِئْتَ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 2767,
        "word": "تُعَذِّبْهُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "ۖ",
        "next_letter": "ۖ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'تُعَذِّبْهُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'ۖ' comes from the word 'ۖ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'تُعَذِّبْهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ۖ' لفظ 'ۖ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3025,
        "word": "ثُمَّ",
        "letter_position": "the 4th letter (position 4 of 14)",
        "next_word": "هَدَىٰ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'ثُمَّ', at the 4th letter (position 4 of 14), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'هَدَىٰ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'ثُمَّ' میں، چوتھا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'هَدَىٰ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 3206,
        "word": "لَكُمْ",
        "letter_position": "the 3rd letter (position 3 of 6)",
        "next_word": "فِيهَا",
        "next_letter": "ف",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَكُمْ', at the 3rd letter (position 3 of 6), we find Meem Sakin (مْ). The next letter 'ف' comes from the word 'فِيهَا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَكُمْ' میں، تیسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ف' لفظ 'فِيهَا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3337,
        "word": "أَنْعَامَكُمْ",
        "letter_position": "the last letter (position 7 of 7)",
        "next_word": "ۗ",
        "next_letter": "ۗ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَنْعَامَكُمْ', at the last letter (position 7 of 7), we find Meem Sakin (مْ). The next letter 'ۗ' comes from the word 'ۗ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَنْعَامَكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ۗ' لفظ 'ۗ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3407,
        "word": "خَلَقْنَاكُمْ",
        "letter_position": "the last letter (position 7 of 7)",
        "next_word": "وَفِيهَا",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'خَلَقْنَاكُمْ', at the last letter (position 7 of 7), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَفِيهَا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'خَلَقْنَاكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَفِيهَا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3428,
        "word": "نُعِيدُكُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "وَمِنْهَا",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'نُعِيدُكُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَمِنْهَا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'نُعِيدُكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَمِنْهَا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3451,
        "word": "نُخْرِجُكُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "تَارَةً",
        "next_letter": "ت",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'نُخْرِجُكُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'ت' comes from the word 'تَارَةً'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'نُخْرِجُكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ت' لفظ 'تَارَةً' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3743,
        "word": "مَوْعِدُكُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "يَوْمُ",
        "next_letter": "ي",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'مَوْعِدُكُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'ي' comes from the word 'يَوْمُ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'مَوْعِدُكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ي' لفظ 'يَوْمُ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3838,
        "word": "ثُمَّ",
        "letter_position": "the 6th letter (position 6 of 14)",
        "next_word": "أَتَىٰ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'ثُمَّ', at the 6th letter (position 6 of 14), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'أَتَىٰ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'ثُمَّ' میں، چھٹا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'أَتَىٰ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 3859,
        "word": "لَهُمْ",
        "letter_position": "the 3rd letter (position 3 of 24)",
        "next_word": "مُوسَىٰ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'لَهُمْ', at the 3rd letter (position 3 of 24), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مُوسَىٰ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'لَهُمْ' میں، تیسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مُوسَىٰ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 3878,
        "word": "وَيْلَكُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "لَا",
        "next_letter": "ل",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'وَيْلَكُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ل' comes from the word 'لَا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'وَيْلَكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ل' لفظ 'لَا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3930,
        "word": "فَيُسْحِتَكُمْ",
        "letter_position": "the last letter (position 7 of 7)",
        "next_word": "بِعَذَابٍ",
        "next_letter": "ب",
        "rule": "ikhfa_shafawi",
        "explanation": "In the word 'فَيُسْحِتَكُمْ', at the last letter (position 7 of 7), we find Meem Sakin (مْ). The next letter 'ب' (Ba) comes from the word 'بِعَذَابٍ'. When this happens, we apply Ikhfa Shafawi (إخفاء شفوي), which means you must conceal or hide the Meem Sakin with a light nasal sound (ghunnah) for two counts. The lips remain closed as you prepare to pronounce the Ba, and the sound is hidden between clear pronunciation and complete merging.",
        "urdu_explanation": "لفظ 'فَيُسْحِتَكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ب' (با) لفظ 'بِعَذَابٍ' سے آتا ہے۔ یہاں اخفاء شفوی ہوگا۔ میم ساکن کو غنہ کے ساتھ چھپا کر بولیں گے۔ ہونٹ بند رکھیں اور با کی تیاری کریں۔ آواز واضح اور ملنے کے درمیان ہوگی۔"
      },
      {
        "position": 3989,
        "word": "أَمْرَهُمْ",
        "letter_position": "the 2nd letter (position 2 of 5)",
        "next_word": "أَمْرَهُمْ",
        "next_letter": "ر",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَمْرَهُمْ', at the 2nd letter (position 2 of 5), we find Meem Sakin (مْ). The next letter 'ر' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَمْرَهُمْ' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ر' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 3995,
        "word": "أَمْرَهُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "بَيْنَهُمْ",
        "next_letter": "ب",
        "rule": "ikhfa_shafawi",
        "explanation": "In the word 'أَمْرَهُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ب' (Ba) comes from the word 'بَيْنَهُمْ'. When this happens, we apply Ikhfa Shafawi (إخفاء شفوي), which means you must conceal or hide the Meem Sakin with a light nasal sound (ghunnah) for two counts. The lips remain closed as you prepare to pronounce the Ba, and the sound is hidden between clear pronunciation and complete merging.",
        "urdu_explanation": "لفظ 'أَمْرَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ب' (با) لفظ 'بَيْنَهُمْ' سے آتا ہے۔ یہاں اخفاء شفوی ہوگا۔ میم ساکن کو غنہ کے ساتھ چھپا کر بولیں گے۔ ہونٹ بند رکھیں اور با کی تیاری کریں۔ آواز واضح اور ملنے کے درمیان ہوگی۔"
      },
      {
        "position": 4006,
        "word": "بَيْنَهُمْ",
        "letter_position": "the 5th letter (position 5 of 10)",
        "next_word": "وَأَسَرُّوا",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'بَيْنَهُمْ', at the 5th letter (position 5 of 10), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَأَسَرُّوا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'بَيْنَهُمْ' میں، پانچواں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَأَسَرُّوا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 4096,
        "word": "يُخْرِجَاكُمْ",
        "letter_position": "the last letter (position 7 of 7)",
        "next_word": "مِنْ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'يُخْرِجَاكُمْ', at the last letter (position 7 of 7), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مِنْ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'يُخْرِجَاكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مِنْ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 4112,
        "word": "أَرْضِكُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "بِسِحْرِهِمَا",
        "next_letter": "ب",
        "rule": "ikhfa_shafawi",
        "explanation": "In the word 'أَرْضِكُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ب' (Ba) comes from the word 'بِسِحْرِهِمَا'. When this happens, we apply Ikhfa Shafawi (إخفاء شفوي), which means you must conceal or hide the Meem Sakin with a light nasal sound (ghunnah) for two counts. The lips remain closed as you prepare to pronounce the Ba, and the sound is hidden between clear pronunciation and complete merging.",
        "urdu_explanation": "لفظ 'أَرْضِكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ب' (با) لفظ 'بِسِحْرِهِمَا' سے آتا ہے۔ یہاں اخفاء شفوی ہوگا۔ میم ساکن کو غنہ کے ساتھ چھپا کر بولیں گے۔ ہونٹ بند رکھیں اور با کی تیاری کریں۔ آواز واضح اور ملنے کے درمیان ہوگی۔"
      },
      {
        "position": 4190,
        "word": "كَيْدَكُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "ثُمَّ",
        "next_letter": "ث",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'كَيْدَكُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ث' comes from the word 'ثُمَّ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'كَيْدَكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ث' لفظ 'ثُمَّ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 4195,
        "word": "ثُمَّ",
        "letter_position": "the 8th letter (position 8 of 14)",
        "next_word": "ائْتُوا",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'ثُمَّ', at the 8th letter (position 8 of 14), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'ائْتُوا'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'ثُمَّ' میں، آٹھواں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'ائْتُوا' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 4281,
        "word": "إِمَّا",
        "letter_position": "the 2nd letter (position 2 of 3)",
        "next_word": "إِمَّا",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'إِمَّا', at the 2nd letter (position 2 of 3), we find Meem Sakin (مْ). The next letter 'م' (Meem) is within the same word. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'إِمَّا' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) اسی لفظ میں ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 4304,
        "word": "وَإِمَّا",
        "letter_position": "the 3rd letter (position 3 of 4)",
        "next_word": "وَإِمَّا",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'وَإِمَّا', at the 3rd letter (position 3 of 4), we find Meem Sakin (مْ). The next letter 'م' (Meem) is within the same word. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'وَإِمَّا' میں، تیسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) اسی لفظ میں ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 4383,
        "word": "حِبَالُهُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "وَعِصِيُّهُمْ",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'حِبَالُهُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَعِصِيُّهُمْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'حِبَالُهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَعِصِيُّهُمْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 4397,
        "word": "وَعِصِيُّهُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "يُخَيَّلُ",
        "next_letter": "ي",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'وَعِصِيُّهُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'ي' comes from the word 'يُخَيَّلُ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'وَعِصِيُّهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ي' لفظ 'يُخَيَّلُ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 4432,
        "word": "سِحْرِهِمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "أَنَّهَا",
        "next_letter": "أ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'سِحْرِهِمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'أ' comes from the word 'أَنَّهَا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'سِحْرِهِمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'أ' لفظ 'أَنَّهَا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 4753,
        "word": "آمَنْتُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "لَهُ",
        "next_letter": "ل",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'آمَنْتُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ل' comes from the word 'لَهُ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'آمَنْتُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ل' لفظ 'لَهُ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 4783,
        "word": "لَكُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "ۖ",
        "next_letter": "ۖ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَكُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'ۖ' comes from the word 'ۖ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ۖ' لفظ 'ۖ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 4869,
        "word": "أَيْدِيَكُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "وَأَرْجُلَكُمْ",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَيْدِيَكُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَأَرْجُلَكُمْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَيْدِيَكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَأَرْجُلَكُمْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 4884,
        "word": "وَأَرْجُلَكُمْ",
        "letter_position": "the last letter (position 7 of 7)",
        "next_word": "مِنْ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'وَأَرْجُلَكُمْ', at the last letter (position 7 of 7), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مِنْ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'وَأَرْجُلَكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مِنْ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 4918,
        "word": "وَلَأُصَلِّبَنَّكُمْ",
        "letter_position": "the last letter (position 9 of 9)",
        "next_word": "فِي",
        "next_letter": "ف",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'وَلَأُصَلِّبَنَّكُمْ', at the last letter (position 9 of 9), we find Meem Sakin (مْ). The next letter 'ف' comes from the word 'فِي'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'وَلَأُصَلِّبَنَّكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ف' لفظ 'فِي' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 5654,
        "word": "لَهُمْ",
        "letter_position": "the 6th letter (position 6 of 24)",
        "next_word": "طَرِيقًا",
        "next_letter": "ط",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَهُمْ', at the 6th letter (position 6 of 24), we find Meem Sakin (مْ). The next letter 'ط' comes from the word 'طَرِيقًا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَهُمْ' میں، چھٹا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ط' لفظ 'طَرِيقًا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 5735,
        "word": "فَأَتْبَعَهُمْ",
        "letter_position": "the last letter (position 7 of 7)",
        "next_word": "فِرْعَوْنُ",
        "next_letter": "ف",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'فَأَتْبَعَهُمْ', at the last letter (position 7 of 7), we find Meem Sakin (مْ). The next letter 'ف' comes from the word 'فِرْعَوْنُ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'فَأَتْبَعَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ف' لفظ 'فِرْعَوْنُ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 5771,
        "word": "فَغَشِيَهُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "مِنَ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'فَغَشِيَهُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مِنَ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'فَغَشِيَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مِنَ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 5784,
        "word": "الْيَمِّ",
        "letter_position": "the 8th letter (position 8 of 12)",
        "next_word": "مَا",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'الْيَمِّ', at the 8th letter (position 8 of 12), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مَا'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'الْيَمِّ' میں، آٹھواں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مَا' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 5800,
        "word": "غَشِيَهُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "وَأَضَلَّ",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'غَشِيَهُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَأَضَلَّ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'غَشِيَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَأَضَلَّ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 5887,
        "word": "أَنْجَيْنَاكُمْ",
        "letter_position": "the last letter (position 8 of 8)",
        "next_word": "مِنْ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'أَنْجَيْنَاكُمْ', at the last letter (position 8 of 8), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مِنْ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'أَنْجَيْنَاكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مِنْ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 5904,
        "word": "عَدُوِّكُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "وَوَاعَدْنَاكُمْ",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'عَدُوِّكُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَوَاعَدْنَاكُمْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'عَدُوِّكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَوَاعَدْنَاكُمْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 5921,
        "word": "وَوَاعَدْنَاكُمْ",
        "letter_position": "the last letter (position 9 of 9)",
        "next_word": "جَانِبَ",
        "next_letter": "ج",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'وَوَاعَدْنَاكُمْ', at the last letter (position 9 of 9), we find Meem Sakin (مْ). The next letter 'ج' comes from the word 'جَانِبَ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'وَوَاعَدْنَاكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ج' لفظ 'جَانِبَ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6038,
        "word": "رَزَقْنَاكُمْ",
        "letter_position": "the last letter (position 7 of 7)",
        "next_word": "وَلَا",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'رَزَقْنَاكُمْ', at the last letter (position 7 of 7), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَلَا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'رَزَقْنَاكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَلَا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6081,
        "word": "عَلَيْكُمْ",
        "letter_position": "the 5th letter (position 5 of 10)",
        "next_word": "غَضَبِي",
        "next_letter": "غ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'عَلَيْكُمْ', at the 5th letter (position 5 of 10), we find Meem Sakin (مْ). The next letter 'غ' comes from the word 'غَضَبِي'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'عَلَيْكُمْ' میں، پانچواں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'غ' لفظ 'غَضَبِي' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6202,
        "word": "ثُمَّ",
        "letter_position": "the 10th letter (position 10 of 14)",
        "next_word": "اهْتَدَىٰ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'ثُمَّ', at the 10th letter (position 10 of 14), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'اهْتَدَىٰ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'ثُمَّ' میں، دسواں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'اهْتَدَىٰ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 6267,
        "word": "هُمْ",
        "letter_position": "the last letter (position 2 of 2)",
        "next_word": "أُولَاءِ",
        "next_letter": "أ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'هُمْ', at the last letter (position 2 of 2), we find Meem Sakin (مْ). The next letter 'أ' comes from the word 'أُولَاءِ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'هُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'أ' لفظ 'أُولَاءِ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6485,
        "word": "أَلَمْ",
        "letter_position": "the last letter (position 3 of 3)",
        "next_word": "يَعِدْكُمْ",
        "next_letter": "ي",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَلَمْ', at the last letter (position 3 of 3), we find Meem Sakin (مْ). The next letter 'ي' comes from the word 'يَعِدْكُمْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَلَمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ي' لفظ 'يَعِدْكُمْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6496,
        "word": "يَعِدْكُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "رَبُّكُمْ",
        "next_letter": "ر",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'يَعِدْكُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ر' comes from the word 'رَبُّكُمْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'يَعِدْكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ر' لفظ 'رَبُّكُمْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6506,
        "word": "رَبُّكُمْ",
        "letter_position": "the last letter (position 4 of 4)",
        "next_word": "وَعْدًا",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'رَبُّكُمْ', at the last letter (position 4 of 4), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَعْدًا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'رَبُّكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَعْدًا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6560,
        "word": "أَمْ",
        "letter_position": "the last letter (position 2 of 2)",
        "next_word": "أَرَدْتُمْ",
        "next_letter": "أ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَمْ', at the last letter (position 2 of 2), we find Meem Sakin (مْ). The next letter 'أ' comes from the word 'أَرَدْتُمْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'أ' لفظ 'أَرَدْتُمْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6571,
        "word": "أَرَدْتُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "أَنْ",
        "next_letter": "أ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَرَدْتُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'أ' comes from the word 'أَنْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَرَدْتُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'أ' لفظ 'أَنْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6595,
        "word": "عَلَيْكُمْ",
        "letter_position": "the last letter (position 10 of 10)",
        "next_word": "غَضَبٌ",
        "next_letter": "غ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'عَلَيْكُمْ', at the last letter (position 10 of 10), we find Meem Sakin (مْ). The next letter 'غ' comes from the word 'غَضَبٌ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'عَلَيْكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'غ' لفظ 'غَضَبٌ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6617,
        "word": "رَبِّكُمْ",
        "letter_position": "the last letter (position 4 of 4)",
        "next_word": "فَأَخْلَفْتُمْ",
        "next_letter": "ف",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'رَبِّكُمْ', at the last letter (position 4 of 4), we find Meem Sakin (مْ). The next letter 'ف' comes from the word 'فَأَخْلَفْتُمْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'رَبِّكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ف' لفظ 'فَأَخْلَفْتُمْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6632,
        "word": "فَأَخْلَفْتُمْ",
        "letter_position": "the last letter (position 7 of 7)",
        "next_word": "مَوْعِدِي",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'فَأَخْلَفْتُمْ', at the last letter (position 7 of 7), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مَوْعِدِي'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'فَأَخْلَفْتُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مَوْعِدِي' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 6707,
        "word": "حُمِّلْنَا",
        "letter_position": "the 2nd letter (position 2 of 5)",
        "next_word": "حُمِّلْنَا",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'حُمِّلْنَا', at the 2nd letter (position 2 of 5), we find Meem Sakin (مْ). The next letter 'م' (Meem) is within the same word. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'حُمِّلْنَا' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) اسی لفظ میں ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 6814,
        "word": "لَهُمْ",
        "letter_position": "the 9th letter (position 9 of 24)",
        "next_word": "عِجْلًا",
        "next_letter": "ع",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَهُمْ', at the 9th letter (position 9 of 24), we find Meem Sakin (مْ). The next letter 'ع' comes from the word 'عِجْلًا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَهُمْ' میں، نواں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ع' لفظ 'عِجْلًا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6874,
        "word": "إِلَـٰهُكُمْ",
        "letter_position": "the last letter (position 7 of 7)",
        "next_word": "وَإِلَـٰهُ",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'إِلَـٰهُكُمْ', at the last letter (position 7 of 7), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَإِلَـٰهُ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'إِلَـٰهُكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَإِلَـٰهُ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6946,
        "word": "إِلَيْهِمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "قَوْلًا",
        "next_letter": "ق",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'إِلَيْهِمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ق' comes from the word 'قَوْلًا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'إِلَيْهِمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ق' لفظ 'قَوْلًا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6965,
        "word": "يَمْلِكُ",
        "letter_position": "the 2nd letter (position 2 of 4)",
        "next_word": "يَمْلِكُ",
        "next_letter": "ل",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'يَمْلِكُ', at the 2nd letter (position 2 of 4), we find Meem Sakin (مْ). The next letter 'ل' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'يَمْلِكُ' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ل' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 6976,
        "word": "لَهُمْ",
        "letter_position": "the 12th letter (position 12 of 24)",
        "next_word": "ضَرًّا",
        "next_letter": "ض",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَهُمْ', at the 12th letter (position 12 of 24), we find Meem Sakin (مْ). The next letter 'ض' comes from the word 'ضَرًّا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَهُمْ' میں، 12واں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ض' لفظ 'ضَرًّا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 7019,
        "word": "لَهُمْ",
        "letter_position": "the 15th letter (position 15 of 24)",
        "next_word": "هَارُونُ",
        "next_letter": "ه",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَهُمْ', at the 15th letter (position 15 of 24), we find Meem Sakin (مْ). The next letter 'ه' comes from the word 'هَارُونُ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَهُمْ' میں، 15واں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ه' لفظ 'هَارُونُ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 7071,
        "word": "فُتِنْتُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "بِهِ",
        "next_letter": "ب",
        "rule": "ikhfa_shafawi",
        "explanation": "In the word 'فُتِنْتُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ب' (Ba) comes from the word 'بِهِ'. When this happens, we apply Ikhfa Shafawi (إخفاء شفوي), which means you must conceal or hide the Meem Sakin with a light nasal sound (ghunnah) for two counts. The lips remain closed as you prepare to pronounce the Ba, and the sound is hidden between clear pronunciation and complete merging.",
        "urdu_explanation": "لفظ 'فُتِنْتُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ب' (با) لفظ 'بِهِ' سے آتا ہے۔ یہاں اخفاء شفوی ہوگا۔ میم ساکن کو غنہ کے ساتھ چھپا کر بولیں گے۔ ہونٹ بند رکھیں اور با کی تیاری کریں۔ آواز واضح اور ملنے کے درمیان ہوگی۔"
      },
      {
        "position": 7142,
        "word": "أَمْرِي",
        "letter_position": "the 10th letter (position 10 of 16)",
        "next_word": "أَمْرِي",
        "next_letter": "ر",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَمْرِي', at the 10th letter (position 10 of 16), we find Meem Sakin (مْ). The next letter 'ر' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَمْرِي' میں، دسواں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ر' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 7272,
        "word": "رَأَيْتَهُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "ضَلُّوا",
        "next_letter": "ض",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'رَأَيْتَهُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'ض' comes from the word 'ضَلُّوا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'رَأَيْتَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ض' لفظ 'ضَلُّوا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 7319,
        "word": "أَمْرِي",
        "letter_position": "the 14th letter (position 14 of 16)",
        "next_word": "أَمْرِي",
        "next_letter": "ر",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَمْرِي', at the 14th letter (position 14 of 16), we find Meem Sakin (مْ). The next letter 'ر' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَمْرِي' میں، 14واں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ر' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 7343,
        "word": "أُمَّ",
        "letter_position": "the last letter (position 2 of 2)",
        "next_word": "لَا",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'أُمَّ', at the last letter (position 2 of 2), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'لَا'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'أُمَّ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'لَا' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 7458,
        "word": "وَلَمْ",
        "letter_position": "the 3rd letter (position 3 of 9)",
        "next_word": "تَرْقُبْ",
        "next_letter": "ت",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'وَلَمْ', at the 3rd letter (position 3 of 9), we find Meem Sakin (مْ). The next letter 'ت' comes from the word 'تَرْقُبْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'وَلَمْ' میں، تیسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ت' لفظ 'تَرْقُبْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 7537,
        "word": "لَمْ",
        "letter_position": "the last letter (position 2 of 2)",
        "next_word": "يَبْصُرُوا",
        "next_letter": "ي",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَمْ', at the last letter (position 2 of 2), we find Meem Sakin (مْ). The next letter 'ي' comes from the word 'يَبْصُرُوا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ي' لفظ 'يَبْصُرُوا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 7841,
        "word": "ثُمَّ",
        "letter_position": "the 12th letter (position 12 of 14)",
        "next_word": "لَنَنْسِفَنَّهُ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'ثُمَّ', at the 12th letter (position 12 of 14), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'لَنَنْسِفَنَّهُ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'ثُمَّ' میں، 12واں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'لَنَنْسِفَنَّهُ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 7870,
        "word": "الْيَمِّ",
        "letter_position": "the last letter (position 12 of 12)",
        "next_word": "نَسْفًا",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'الْيَمِّ', at the last letter (position 12 of 12), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'نَسْفًا'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'الْيَمِّ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'نَسْفًا' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 8174,
        "word": "لَهُمْ",
        "letter_position": "the 18th letter (position 18 of 24)",
        "next_word": "يَوْمَ",
        "next_letter": "ي",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَهُمْ', at the 18th letter (position 18 of 24), we find Meem Sakin (مْ). The next letter 'ي' comes from the word 'يَوْمَ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَهُمْ' میں، 18واں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ي' لفظ 'يَوْمَ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 8199,
        "word": "حِمْلًا",
        "letter_position": "the 2nd letter (position 2 of 4)",
        "next_word": "حِمْلًا",
        "next_letter": "ل",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'حِمْلًا', at the 2nd letter (position 2 of 4), we find Meem Sakin (مْ). The next letter 'ل' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'حِمْلًا' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ل' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 8304,
        "word": "بَيْنَهُمْ",
        "letter_position": "the last letter (position 10 of 10)",
        "next_word": "إِنْ",
        "next_letter": "إ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'بَيْنَهُمْ', at the last letter (position 10 of 10), we find Meem Sakin (مْ). The next letter 'إ' comes from the word 'إِنْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'بَيْنَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'إ' لفظ 'إِنْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 8320,
        "word": "لَبِثْتُمْ",
        "letter_position": "the 5th letter (position 5 of 10)",
        "next_word": "إِلَّا",
        "next_letter": "إ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَبِثْتُمْ', at the 5th letter (position 5 of 10), we find Meem Sakin (مْ). The next letter 'إ' comes from the word 'إِلَّا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَبِثْتُمْ' میں، پانچواں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'إ' لفظ 'إِلَّا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 8386,
        "word": "أَمْثَلُهُمْ",
        "letter_position": "the 2nd letter (position 2 of 6)",
        "next_word": "أَمْثَلُهُمْ",
        "next_letter": "ث",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَمْثَلُهُمْ', at the 2nd letter (position 2 of 6), we find Meem Sakin (مْ). The next letter 'ث' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَمْثَلُهُمْ' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ث' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 8394,
        "word": "أَمْثَلُهُمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "طَرِيقَةً",
        "next_letter": "ط",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَمْثَلُهُمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'ط' comes from the word 'طَرِيقَةً'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَمْثَلُهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ط' لفظ 'طَرِيقَةً' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 8420,
        "word": "لَبِثْتُمْ",
        "letter_position": "the last letter (position 10 of 10)",
        "next_word": "إِلَّا",
        "next_letter": "إ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَبِثْتُمْ', at the last letter (position 10 of 10), we find Meem Sakin (مْ). The next letter 'إ' comes from the word 'إِلَّا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَبِثْتُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'إ' لفظ 'إِلَّا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 8567,
        "word": "أَمْتًا",
        "letter_position": "the 2nd letter (position 2 of 4)",
        "next_word": "أَمْتًا",
        "next_letter": "ت",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَمْتًا', at the 2nd letter (position 2 of 4), we find Meem Sakin (مْ). The next letter 'ت' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَمْتًا' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ت' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 8689,
        "word": "هَمْسًا",
        "letter_position": "the 2nd letter (position 2 of 4)",
        "next_word": "هَمْسًا",
        "next_letter": "س",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'هَمْسًا', at the 2nd letter (position 2 of 4), we find Meem Sakin (مْ). The next letter 'س' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'هَمْسًا' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'س' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 8821,
        "word": "أَيْدِيهِمْ",
        "letter_position": "the last letter (position 6 of 6)",
        "next_word": "وَمَا",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَيْدِيهِمْ', at the last letter (position 6 of 6), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَمَا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَيْدِيهِمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَمَا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 8838,
        "word": "خَلْفَهُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "وَلَا",
        "next_letter": "و",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'خَلْفَهُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'و' comes from the word 'وَلَا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'خَلْفَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'و' لفظ 'وَلَا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 9125,
        "word": "لَعَلَّهُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "يَتَّقُونَ",
        "next_letter": "ي",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَعَلَّهُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ي' comes from the word 'يَتَّقُونَ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَعَلَّهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ي' لفظ 'يَتَّقُونَ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 9157,
        "word": "لَهُمْ",
        "letter_position": "the 21th letter (position 21 of 24)",
        "next_word": "ذِكْرًا",
        "next_letter": "ذ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَهُمْ', at the 21th letter (position 21 of 24), we find Meem Sakin (مْ). The next letter 'ذ' comes from the word 'ذِكْرًا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَهُمْ' میں، 21واں حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ذ' لفظ 'ذِكْرًا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 9368,
        "word": "وَلَمْ",
        "letter_position": "the 6th letter (position 6 of 9)",
        "next_word": "نَجِدْ",
        "next_letter": "ن",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'وَلَمْ', at the 6th letter (position 6 of 9), we find Meem Sakin (مْ). The next letter 'ن' comes from the word 'نَجِدْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'وَلَمْ' میں، چھٹا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ن' لفظ 'نَجِدْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 9931,
        "word": "ثُمَّ",
        "letter_position": "the last letter (position 14 of 14)",
        "next_word": "اجْتَبَاهُ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'ثُمَّ', at the last letter (position 14 of 14), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'اجْتَبَاهُ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'ثُمَّ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'اجْتَبَاهُ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 10022,
        "word": "بَعْضُكُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "لِبَعْضٍ",
        "next_letter": "ل",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'بَعْضُكُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ل' comes from the word 'لِبَعْضٍ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'بَعْضُكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ل' لفظ 'لِبَعْضٍ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 10048,
        "word": "فَإِمَّا",
        "letter_position": "the 3rd letter (position 3 of 4)",
        "next_word": "فَإِمَّا",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'فَإِمَّا', at the 3rd letter (position 3 of 4), we find Meem Sakin (مْ). The next letter 'م' (Meem) is within the same word. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'فَإِمَّا' میں، تیسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) اسی لفظ میں ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 10066,
        "word": "يَأْتِيَنَّكُمْ",
        "letter_position": "the last letter (position 7 of 7)",
        "next_word": "مِنِّي",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'يَأْتِيَنَّكُمْ', at the last letter (position 7 of 7), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مِنِّي'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'يَأْتِيَنَّكُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مِنِّي' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 10417,
        "word": "وَلَمْ",
        "letter_position": "the last letter (position 9 of 9)",
        "next_word": "يُؤْمِنْ",
        "next_letter": "ي",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'وَلَمْ', at the last letter (position 9 of 9), we find Meem Sakin (مْ). The next letter 'ي' comes from the word 'يُؤْمِنْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'وَلَمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ي' لفظ 'يُؤْمِنْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 10496,
        "word": "أَفَلَمْ",
        "letter_position": "the last letter (position 4 of 4)",
        "next_word": "يَهْدِ",
        "next_letter": "ي",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَفَلَمْ', at the last letter (position 4 of 4), we find Meem Sakin (مْ). The next letter 'ي' comes from the word 'يَهْدِ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَفَلَمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ي' لفظ 'يَهْدِ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 10510,
        "word": "لَهُمْ",
        "letter_position": "the last letter (position 24 of 24)",
        "next_word": "كَمْ",
        "next_letter": "ك",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لَهُمْ', at the last letter (position 24 of 24), we find Meem Sakin (مْ). The next letter 'ك' comes from the word 'كَمْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ك' لفظ 'كَمْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 10515,
        "word": "كَمْ",
        "letter_position": "the last letter (position 2 of 2)",
        "next_word": "أَهْلَكْنَا",
        "next_letter": "أ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'كَمْ', at the last letter (position 2 of 2), we find Meem Sakin (مْ). The next letter 'أ' comes from the word 'أَهْلَكْنَا'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'كَمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'أ' لفظ 'أَهْلَكْنَا' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 10538,
        "word": "قَبْلَهُمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "مِنَ",
        "next_letter": "م",
        "rule": "idgham_shafawi",
        "explanation": "In the word 'قَبْلَهُمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'م' (Meem) comes from the word 'مِنَ'. When this happens, we apply Idgham Shafawi (إدغام شفوي), which means you must merge the first Meem completely into the second Meem WITH a nasal sound (ghunnah) for two counts. The two Meems become one emphasized Meem with nasalization. This is also called Idgham Mithlayn (merging of two identical letters).",
        "urdu_explanation": "لفظ 'قَبْلَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'م' (میم) لفظ 'مِنَ' سے آتا ہے۔ یہاں ادغام شفوی ہوگا۔ پہلے میم کو دوسرے میم میں غنہ کے ساتھ ملا دیں۔ دونوں میم مل کر ایک مضبوط میم بن جاتے ہیں۔ اسے ادغام مثلین بھی کہتے ہیں۔"
      },
      {
        "position": 10559,
        "word": "يَمْشُونَ",
        "letter_position": "the 2nd letter (position 2 of 5)",
        "next_word": "يَمْشُونَ",
        "next_letter": "ش",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'يَمْشُونَ', at the 2nd letter (position 2 of 5), we find Meem Sakin (مْ). The next letter 'ش' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'يَمْشُونَ' میں، دوسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ش' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 10582,
        "word": "مَسَاكِنِهِمْ",
        "letter_position": "the last letter (position 7 of 7)",
        "next_word": "ۗ",
        "next_letter": "ۗ",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'مَسَاكِنِهِمْ', at the last letter (position 7 of 7), we find Meem Sakin (مْ). The next letter 'ۗ' comes from the word 'ۗ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'مَسَاكِنِهِمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ۗ' لفظ 'ۗ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 10704,
        "word": "مُسَمًّى",
        "letter_position": "the 3rd letter (position 3 of 4)",
        "next_word": "مُسَمًّى",
        "next_letter": "ى",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'مُسَمًّى', at the 3rd letter (position 3 of 4), we find Meem Sakin (مْ). The next letter 'ى' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'مُسَمًّى' میں، تیسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ى' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 10755,
        "word": "بِحَمْدِ",
        "letter_position": "the 3rd letter (position 3 of 4)",
        "next_word": "بِحَمْدِ",
        "next_letter": "د",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'بِحَمْدِ', at the 3rd letter (position 3 of 4), we find Meem Sakin (مْ). The next letter 'د' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'بِحَمْدِ' میں، تیسرا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'د' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 10788,
        "word": "الشَّمْسِ",
        "letter_position": "the 4th letter (position 4 of 5)",
        "next_word": "الشَّمْسِ",
        "next_letter": "س",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'الشَّمْسِ', at the 4th letter (position 4 of 5), we find Meem Sakin (مْ). The next letter 'س' is within the same word. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'الشَّمْسِ' میں، چوتھا حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'س' اسی لفظ میں ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 10963,
        "word": "مِنْهُمْ",
        "letter_position": "the last letter (position 4 of 4)",
        "next_word": "زَهْرَةَ",
        "next_letter": "ز",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'مِنْهُمْ', at the last letter (position 4 of 4), we find Meem Sakin (مْ). The next letter 'ز' comes from the word 'زَهْرَةَ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'مِنْهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ز' لفظ 'زَهْرَةَ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 11009,
        "word": "لِنَفْتِنَهُمْ",
        "letter_position": "the last letter (position 7 of 7)",
        "next_word": "فِيهِ",
        "next_letter": "ف",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'لِنَفْتِنَهُمْ', at the last letter (position 7 of 7), we find Meem Sakin (مْ). The next letter 'ف' comes from the word 'فِيهِ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'لِنَفْتِنَهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ف' لفظ 'فِيهِ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 11241,
        "word": "أَوَلَمْ",
        "letter_position": "the last letter (position 4 of 4)",
        "next_word": "تَأْتِهِمْ",
        "next_letter": "ت",
        "rule": "izhar_shafawi",
        "explanation": "In the word 'أَوَلَمْ', at the last letter (position 4 of 4), we find Meem Sakin (مْ). The next letter 'ت' comes from the word 'تَأْتِهِمْ'. Since this letter is neither Ba (ب) nor Meem (م), we apply Izhar Shafawi (إظهار شفوي), which means you must pronounce the Meem Sakin clearly and distinctly, without any nasal sound (ghunnah), without hiding, and without merging it into the next letter. The lips close completely for the Meem and then open for the following letter.",
        "urdu_explanation": "لفظ 'أَوَلَمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ت' لفظ 'تَأْتِهِمْ' سے آتا ہے۔ یہ حرف نہ با (ب) ہے نہ میم (م)، اس لیے یہاں اظہار شفوی ہوگا۔ میم ساکن کو صاف اور واضح بولیں، بغیر غنہ، بغیر چھپائے، اور بغیر اگلے حرف میں ملائے۔"
      },
      {
        "position": 11252,
        "word": "تَأْتِهِمْ",
        "letter_position": "the last letter (position 5 of 5)",
        "next_word": "بَيِّنَةُ",
        "next_letter": "ب",
        "rule": "ikhfa_shafawi",
        "explanation": "In the word 'تَأْتِهِمْ', at the last letter (position 5 of 5), we find Meem Sakin (مْ). The next letter 'ب' (Ba) comes from the word 'بَيِّنَةُ'. When this happens, we apply Ikhfa Shafawi (إخفاء شفوي), which means you must conceal or hide the Meem Sakin with a light nasal sound (ghunnah) for two counts. The lips remain closed as you prepare to pronounce the Ba, and the sound is hidden between clear pronunciation and complete merging.",
        "urdu_explanation": "لفظ 'تَأْتِهِمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ب' (با) لفظ 'بَيِّنَةُ' سے آتا ہے۔ یہاں اخفاء شفوی ہوگا۔ میم ساکن کو غنہ کے ساتھ چھپا کر بولیں گے۔ ہونٹ بند رکھیں اور با کی تیاری کریں۔ آواز واضح اور ملنے کے درمیان ہوگی۔"
      },
      {
        "position": 11321,
        "word": "أَهْلَكْنَاهُمْ",
        "letter_position": "the last letter (position 8 of 8)",
        "next_word": "بِعَذَابٍ",
        "next_letter": "ب",
        "rule": "ikhfa_shafawi",
        "explanation": "In the word 'أَهْلَكْنَاهُمْ', at the last letter (position 8 of 8), we find Meem Sakin (مْ). The next letter 'ب' (Ba) comes from the word 'بِعَذَابٍ'. When this happens, we apply Ikhfa Shafawi (إخفاء شفوي), which means you must conceal or hide the Meem Sakin with a light nasal sound (ghunnah) for two counts. The lips remain closed as you prepare to pronounce the Ba, and the sound is hidden between clear pronunciation and complete merging.",
        "urdu_explanation": "لفظ 'أَهْلَكْنَاهُمْ' میں، آخری حرف ، میم ساکن (مْ) ہے۔ اگلا حرف 'ب' (با) لفظ 'بِعَذَابٍ' سے آتا ہے۔ یہاں اخفاء شفوی ہوگا۔ میم ساکن کو غنہ کے ساتھ چھپا کر بولیں گے۔ ہونٹ بند رکھیں اور با کی تیاری کریں۔ آواز واضح اور ملنے کے درمیان ہوگی۔"
      }
    ],
    "meem_sakin_positions": [
      97,
      474,
      520,
      577,
      1277,
      1482,
      1631,
      1826,
      1898,
      1920,
      2051,
      2090,
      2141,
      2231,
      2300,
      2767,
      3025,
      3206,
      3337,
      3407,
      3428,
      3451,
      3743,
      3838,
      3859,
      3878,
      3930,
      3989,
      3995,
      4006,
      4096,
      4112,
      4190,
      4195,
      4281,
      4304,
      4383,
      4397,
      4432,
      4753,
      4783,
      4869,
      4884,
      4918,
      5654,
      5735,
      5771,
      5784,
      5800,
      5887,
      5904,
      5921,
      6038,
      6081,
      6202,
      6267,
      6485,
      6496,
      6506,
      6560,
      6571,
      6595,
      6617,
      6632,
      6707,
      6814,
      6874,
      6946,
      6965,
      6976,
      7019,
      7071,
      7142,
      7272,
      7319,
      7343,
      7458,
      7537,
      7841,
      7870,
      8174,
      8199,
      8304,
      8320,
      8386,
      8394,
      8420,
      8567,
      8689,
      8821,
      8838,
      9125,
      9157,
      9368,
      9931,
      10022,
      10048,
      10066,
      10417,
      10496,
      10510,
      10515,
      10538,
      10559,
      10582,
      10704,
      10755,
      10788,
      10963,
      11009,
      11241,
      11252,
      11321
    ],
    "ikhfa_shafawi": [
      [
        3930,
        "ب"
      ],
      [
        3995,
        "ب"
      ],
      [
        4112,
        "ب"
      ],
      [
        7071,
        "ب"
      ],
      [
        11252,
        "ب"
      ],
      [
        11321,
        "ب"
      ]
    ],
    "idgham_shafawi": [
      [
        97,
        "م"
      ],
      [
        520,
        "م"
      ],
      [
        577,
        "م"
      ],
      [
        1826,
        "م"
      ],
      [
        1898,
        "م"
      ],
      [
        1920,
        "م"
      ],
      [
        2141,
        "م"
      ],
      [
        2231,
        "م"
      ],
      [
        2300,
        "م"
      ],
      [
        3025,
        "م"
      ],
      [
        3838,
        "م"
      ],
      [
        3859,
        "م"
      ],
      [
        4096,
        "م"
      ],
      [
        4195,
        "م"
      ],
      [
        4281,
        "م"
      ],
      [
        4304,
        "م"
      ],
      [
        4884,
        "م"
      ],
      [
        5771,
        "م"
      ],
      [
        5784,
        "م"
      ],
      [
        5887,
        "م"
      ],
      [
        6202,
        "م"
      ],
      [
        6632,
        "م"
      ],
      [
        6707,
        "م"
      ],
      [
        7343,
        "م"
      ],
      [
        7841,
        "م"
      ],
      [
        7870,
        "م"
      ],
      [
        9931,
        "م"
      ],
      [
        10048,
        "م"
      ],
      [
        10066,
        "م"
      ],
      [
        10538,
        "م"
      ]
    ],
    "izhar_shafawi": [
      [
        474,
        "ك"
      ],
      [
        1277,
        "ي"
      ],
      [
        1482,
        "ر"
      ],
      [
        1631,
        "ر"
      ],
      [
        2051,
        "ش"
      ],
      [
        2090,
        "ع"
      ],
      [
        2767,
        "ۖ"
      ],
      [
        3206,
        "ف"
      ],
      [
        3337,
        "ۗ"
      ],
      [
        3407,
        "و"
      ],
      [
        3428,
        "و"
      ],
      [
        3451,
        "ت"
      ],
      [
        3743,
        "ي"
      ],
      [
        3878,
        "ل"
      ],
      [
        3989,
        "ر"
      ],
      [
        4006,
        "و"
      ],
      [
        4190,
        "ث"
      ],
      [
        4383,
        "و"
      ],
      [
        4397,
        "ي"
      ],
      [
        4432,
        "أ"
      ],
      [
        4753,
        "ل"
      ],
      [
        4783,
        "ۖ"
      ],
      [
        4869,
        "و"
      ],
      [
        4918,
        "ف"
      ],
      [
        5654,
        "ط"
      ],
      [
        5735,
        "ف"
      ],
      [
        5800,
        "و"
      ],
      [
        5904,
        "و"
      ],
      [
        5921,
        "ج"
      ],
      [
        6038,
        "و"
      ],
      [
        6081,
        "غ"
      ],
      [
        6267,
        "أ"
      ],
      [
        6485,
        "ي"
      ],
      [
        6496,
        "ر"
      ],
      [
        6506,
        "و"
      ],
      [
        6560,
        "أ"
      ],
      [
        6571,
        "أ"
      ],
      [
        6595,
        "غ"
      ],
      [
        6617,
        "ف"
      ],
      [
        6814,
        "ع"
      ],
      [
        6874,
        "و"
      ],
      [
        6946,
        "ق"
      ],
      [
        6965,
        "ل"
      ],
      [
        6976,
        "ض"
      ],
      [
        7019,
        "ه"
      ],
      [
        7142,
        "ر"
      ],
      [
        7272,
        "ض"
      ],
      [
        7319,
        "ر"
      ],
      [
        7458,
        "ت"
      ],
      [
        7537,
        "ي"
      ],
      [
        8174,
        "ي"
      ],
      [
        8199,
        "ل"
      ],
      [
        8304,
        "إ"
      ],
      [
        8320,
        "إ"
      ],
      [
        8386,
        "ث"
      ],
      [
        8394,
        "ط"
      ],
      [
        8420,
        "إ"
      ],
      [
        8567,
        "ت"
      ],
      [
        8689,
        "س"
      ],
      [
        8821,
        "و"
      ],
      [
        8838,
        "و"
      ],
      [
        9125,
        "ي"
      ],
      [
        9157,
        "ذ"
      ],
      [
        9368,
        "ن"
      ],
      [
        10022,
        "ل"
      ],
      [
        10417,
        "ي"
      ],
      [
        10496,
        "ي"
      ],
      [
        10510,
        "ك"
      ],
      [
        10515,
        "أ"
      ],
      [
        10559,
        "ش"
      ],
      [
        10582,
        "ۗ"
      ],
      [
        10704,
        "ى"
      ],
      [
        10755,
        "د"
      ],
      [
        10788,
        "س"
      ],
      [
        10963,
        "ز"
      ],
      [
        11009,
        "ف"
      ],
      [
        11241,
        "ت"
      ]
    ]
  }
}